{"character_name": "A (First Raikage)","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/70/A.png","description": "A (エー, Ē, Viz: Ei, English TV: Ay) was the First Raikage (初代雷影, Shodai Raikage, literally meaning: First or Founding Lightning Shadow) who founded Kumogakure in the Land of Lightning.","affiliation":"Kumogakure","background": "During his leadership in the early days of Kumogakure after the Warring States Period, A presumably sent the Gold and Silver Brothers to capture the Nine-Tails, a task at which they ultimately failed. He also gave land in the Valley of Clouds and Lightning to the Yotsuki Clan in return for their loyalty.","ability": "As the First Raikage and the founder of Kumo, A was undoubtedly a powerful shinobi.","appearance": "A was a dark-skinned man, with prominent creases under his eyes and a mop of shaggy black hair, which partially obscured his forehead protector. In terms of attire, he wore a high-collared dark kimono-shirt, dark pants bound by a sash and a light-coloured scarf around his neck. He also wore small stud-earrings. In the anime, his attire consists of a cream-coloured coat with a high collar, a white forehead protector, zōri and a purple scarf around his neck."} 
{"character_name": "A (Fourth Raikage)","character_pic":"https://static.wikia.nocookie.net/naruto/images/4/4c/Fourth_Raikage_2.png","description": "A is the Fourth Raikage (四代目雷影, Yondaime Raikage, literally meaning: Fourth Lightning Shadow) of Kumogakure.","affiliation":"Kumogakure, Allied Shinobi Forces","background": "A is the son of the Third Raikage, who groomed him for the position of the Fourth Raikage. At some point in the past, due to A not having a blood sibling who could be his tag partner, try outs consisting of young children were gathered in order to determine one, in keeping with a long standing Kumogakure tradition of the Raikage having a tag team partner. After many attempts, they found only one child who was able to successfully match A's power and use the Lightning Release: Double Lariat on a training dummy.","ability": "As the Fourth Raikage, A is an extremely powerful shinobi, being chosen as the Supreme Leader of the Allied Shinobi Forces, even after losing his dominant arm. His signature fighting style combines the elements of ninjutsu and taijutsu to form nintaijutsu. Using it, he could easily directly engage in battle with a tailed beast, defeat a fully transformed Jūgo, and overwhelm a Mangekyō Sharingan-wielding Sasuke.","appearance": "A has dark skin with a large muscular build, white hair (blond in the anime) combed back, a small moustache and goatee. His face has pronounced cheekbones and tear troughs under his eyes, and a prominent crease across his forehead. He has pointed canines and his top lip also has a darker hue than the bottom one; traits he inherited from his father. During his fight with Sasuke, he amputated his left forearm after it was burned by Amaterasu. A often wears a white haori without a shirt underneath and occasionally the traditional Raikage hat. He has black Fūma Shuriken tattoos on both shoulders and originally wore large, golden vambraces on his wrists, though he discarded them after the Five Kage Summit, wearing one on his remaining arm briefly near the start of the Fourth Shinobi World War. He also wears a gold belt around his waist with a boar's face engraved in the centre, black pants with torn ends, Kumo-nin shin guards, and shinobi sandals. All of these aspects combined give him the appearance of a professional wrestler. After relinquishing the role of Raikage to Darui, A began wearing a simple black kimono held closed by a white sash. He has also begun balding with visible"} 
{"character_name": "Abiru","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/72/Abiru_new.png","description": "Abiru (アビル) is a former academy student of Sunagakure.","affiliation":"Sunagakure","background": "Abiru had only just entered the Academy and was inexperienced in ninjutsu. He used to play games with Tsuchino, Kashike, and Tomari around Sunagakure. He loved football, but when his ball got stuck on a roof he had no way of getting it down since he had yet to learn how to climb walls. Gaara got it down for him, but he ran away in fear. Gaara accidentally attacked Abiru and his friends while trying to stop them, but the appearance of Gaara's uncle saved Abiru's life. Another time, Abiru and his friends bullied Shira for not being able to enter the academy due to his lack of skills in ninjutsu and genjutsu.","ability": "","appearance": "Abiru has short puffy dark-coloured hair and big brown eyes. He wears a long-sleeved black shirt."} 
{"character_name": "Ada","character_pic":"https://static.wikia.nocookie.net/naruto/images/f/f6/Ada_Infobox_Image.png","description": "Ada (エイダ, Eida) is a former member of Kara and a citizen of Konohagakure.","affiliation":"Kara, Konohagakure ","background": "In his plot to kill Jigen, Amado heavily modified Ada, along with her younger brother Daemon, with Shinobi-Ware with capabilities exceeding that of Jigen. The effects of her modifications left her forever despising Amado. Because of her superior might, Jigen had ordered for her disposal. Boro was given the order. However, affected by Ada's powers, Boro could not bring himself to complete the task, and instead hid Ada and Daemon in a remote location operated by his cult for his own uses.","ability": "As with most members of Kara, Ada had been modified with Scientific Ninja Tools by Amado. While the true depths of her power is unknown, and she claims she can only use taijutsu, Amado has noted that her combat abilities exceed Jigen's.","appearance": "Ada has long blue hair with loops on the tips and pink streaks, and a beauty mark under the outer corner on both of her eyes. Her eyes are turquoise with uniquely having crescent moons wrapped around the dark irides that curve to the right. She wears a white long-sleeved turtleneck shirt with bishop sleeves and turquoise bracelets on her wrists and dark shorts with patterns of blue stars and a moon, and a planet with a ring around it, blue shooting star-shaped earrings, and black high-heeled sandals with two blue crescent moons and blue heels. Ada also wears matching rings on her ring finger and her pinky finger, and has pink nail polish on her fingernails and toe nails, and blue mascara. In the anime, Ada wears a small pair of blue bracelets. Three years after Boruto left Konoha, Ada wears an off-the-shoulder blouse with bishop sleeves and a necklace with a crescent moon and a small star pendant while retaining her other jewelry accessories, dark shorts, and her black high-heeled sandals with blue heels. When using the Senrigan, the sclera of Ada's left eye turns black with three dots and has a crescent moon design. In the anime, Ada's Senrigan has an expanded design: the sclera of her left eye turns galaxy-patterned and her iris turns bright blue with a dark crescent moon design, two white orbit-like dots at both side and the other big planet-like pupil on the centre."} 
{"character_name": "Aino","character_pic":"https://static.wikia.nocookie.net/naruto/images/b/bb/Aino.png","description": "Aino (アイノ) was a servant of Tenji, the emperor of the Land of Ancestors. On orders from her emperor, Aino became Kaguya Ōtsutsuki's personal attendant when she first appeared on Earth.","affiliation":"Land of Ancestors","background": "Aino lived a full millennium before the start of the main story. She worked as an the attendant of the emperor of the Land of Ancestors. After arriving on Earth, Kaguya was made Tenji's concubine and ordered Aino to serve as Kaguya's personal attendant who appeared to be more open with her than she was with most sharing information about the God Tree with each other. After some time, the Land of That began harassing the Land of Ancestors and subsequently began to demand ownership of Kaguya. To protect her, Aino led Kaguya into hiding but when they were attacked, Kaguya protected Aino and fled with her. On the run, Aino was protected by Kaguya until they reached the God Tree. Aino soon realised that Kaguya was in the early stages of pregnancy causing her to be weakened. Without a second thought, Aino sacrificed herself to protect Kaguya and her unborn children. Her death visibly horrified the usually stone-faced Kaguya.","ability": "","appearance": "Aino had long black hair tied in a bun and brown eyes. She wore the uniform accustom to attendants appropriate for women of her era with a pink bandana."} 
{"character_name": "Akane","character_pic":"https://static.wikia.nocookie.net/naruto/images/a/aa/Akane.png","description": "Akane (アカネ) was a bully who stole Pochi from Inari.","affiliation":"Land of Waves","background": "After he lost interest in Pochi, Akane threw him into the sea. When Inari hesitated to go in and save him, Akane pushed him in too. Although Inari started to drown, Akane and his friends left. After Kaiza saved Inari, he gave Akane a stern talking to. He appears to not own Pochi anymore.","ability": "","appearance": "Akane has short brown hair and small dark-coloured eyes."} 
{"character_name": "Akatsuchi","character_pic":"https://static.wikia.nocookie.net/naruto/images/1/16/Akatsuchi_Part_II.png","description": "Akatsuchi (赤ツチ) is an Iwagakure shinobi. A war-experienced point-of-pride for Iwagakure, Akatsuchi's unwavering loyalty to the Third Tsuchikage earned him the title as his 'shield'.","affiliation":"Iwagakure, Allied Shinobi Forces","background": "In the anime, Akatsuchi was present during a council meeting to discuss an invitation from Konohagakure and Sunagakure to join an impromptu Chūnin Exams they would be hosting together. As Ōnoki arrogantly believed this was an attempt by the two villages to better gauge Iwagakure's strength for an upcoming fight, Akatsuchi simply suggested they just turn down the offer, to which Ōnoki firmly agreed.","ability": "As a jōnin, he is likely a formidable shinobi. With his credibility, he was chosen to guard not only the Third Tsuchikage, but the Fourth Tsuchikage as well, during their respective meetings at the Kage Summit.","appearance": "Akatsuchi is a large and imposing man, with dark eyes and black hair that spikes out at the back from underneath his bandanna-styled forehead protector. He also has large cheeks, and a plump nose which give him an overall look of constant joviality. He wears the red Iwagakure uniform which has both its sleeves, underneath his flak jacket, and accentuates it with a yellow scarf which he wraps around his neck. In later years after the Fourth Shinobi World War, Akatsuchi grows a beard and seemingly discards his forehead protector and retains his yellow scarf. He also ties his hair in a ponytail and he has apparently trimmed down somewhat as his cheeks became less plump. He wears a brown kimono and pants."} 
{"character_name": "Arashi","character_pic":"https://static.wikia.nocookie.net/naruto/images/f/fd/Arashi.png","description": "Arashi (アラシ) was the leader of the Fūma clan's shinobi, having aligned with Orochimaru in the hope to rebuild their clan.","affiliation":"Otogakure","background": "After the Fūma clan finished a war with a neighbouring country, they wandered into the Land of Rice Fields hoping to settle down. But, near the end of their journey, they met Orochimaru, who offered them a chance to return to their former glory by following him. Arashi, seen as the hope of the Fūma clan, along with Jigumo, Kamikiri, Kotohime, and Kagerō, accept the offer to restore the Fūma clan.","ability": "Arashi was one of the most talented members of the Fūma clan. He could perform his clan's most secret technique that creates a pyramid shaped barrier that constricts and potentially crushes the opponent. After absorbing the bodies of two other Fūma clan members, he became a large malleable mass able to unleash the signature techniques of his absorbed kin.","appearance": "Arashi had long, smooth, chin-length purple hair and grey-coloured eyes. His bangs hung just over his eyebrows. He wore a green short sleeve shirt, but the collar and sleeves were white. He also wore two black arm sleeves on his lower arms and long grey pants."} 
{"character_name": "Asuma Sarutobi","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/7c/Asuma.png","description": "Asuma Sarutobi (猿飛アスマ, Sarutobi Asuma) was a jōnin of Konohagakure's Sarutobi clan and a former member of the Twelve Guardian Ninja. He was also the leader of Team 10 which consists of Shikamaru Nara, Ino Yamanaka, and Chōji Akimichi.","affiliation":"Konohagakure","background": "Asuma was born to Biwako and Hiruzen Sarutobi, the Third Hokage. During his Academy entrance ceremony, Asuma became friends with Kurenai Yūhi. In the anime, during the Chūnin Exams, Asuma was placed on a team with Kurenai and Raidō Namiashi. He later cheered on his classmates during the third round of the Chūnin Exams. During the Nine-Tailed Demon Fox's Attack, Asuma along with the other young ninja were barred from participating in the defence of the village by Shinku Yūhi and the other senior shinobi. A few years after the event, Asuma would become an uncle to Konohamaru. He later became a jōnin. About seven years before the start of the series, he had a disagreement with his father and left Konoha to pursue his personal interests. During his absence, he became one of the Twelve Guardian Ninja, a group that protected the Land of Fire's daimyō, indicated by the sash on his waist. During this time he developed a strong friendship with the monk Chiriku, who would go on to become the head monk of the Fire Temple. Prior to returning to Konoha to resume active military duty, he accumulated a bounty of 35 million ryō on the black market, something he seemed to be particularly proud of since it was a testament of his skill, even bragging that his bounty was 5 million more than Chiriku. After returning to the village, Asuma resumed his jōnin duties and became a teacher of Inomatsu and presumably some more students. About twelve years after the Nine-Tailed Demon Fox's Attack, seeing his classmate fall into deeper self-pity from losing Obito Uchiha and Rin Nohara, Asuma, along with Might Guy and Kurenai decided to speak with the Third Hokage, voicing their disapproval of Kakashi being in Anbu with such bitterness and suggested instead that he be re-assigned as a jōnin sensei in the hopes of restoring Kakashi's kindness.","ability": "Asuma was a highly talented, well respected jōnin of village, gaining praise from Shikaku Nara of being a great shinobi who is not easy to take down. He established a great record in military prowess — something many upcoming shinobi greatly admired. His abilities earned him a position into the Twelve Guardian Ninja — an elite hand-picked team which served to protect the Land of Fire's daimyō — a role which later earned him a bounty of 35,000,000 ryō. He could effortlessly take down nine Oto-nin during the Konoha Crush, noted to have been chūnin-level or above, and was able to compete against Hidan, a powerful member of the Akatsuki, while also protecting his team.","appearance": "Asuma was a tall man, with brown eyes, olive skin, short black spiky hair, and a beard. His clothing consisted of the standard Konoha ninja uniform with the sleeves rolled up half way, flak jacket, regular shinobi sandals and forehead protector. He also wore a sash that had the kanji for 'Fire' (火) marked on it around his waist, a pair of black bangles, and bandages wrapped around the arms of his sleeves. As a genin, he wore a white short-sleeved shirt with a blue and black collar over chain-mail armour, along with a simple white vest, a pair of black pants, and a white belt. In the anime, it was shown that while he was a member of the Twelve Guardian Ninja, he wore a simple long sleeved shirt with bandages on the arms, pants, that sash denoting he was a guardian and a jacket with a fur collar. He also had his trench knives with him at that point."} 
{"character_name": "Baki","character_pic":"https://static.wikia.nocookie.net/naruto/images/0/04/Baki_Infobox.png","description": "Baki (バキ) is a jōnin of Sunagakure and a member of its advisory council.","affiliation":"Sunagakure","background": "","ability": "Baki is a powerful jōnin of his village, as well as one of its council's highest-ranking members; he's often shown taking charge of military operations, as seen during Deidara's raid on the village at the start of Part II. In Part I, engaging high-ranking Konohagakure shinobi was of no concern for him. He also appears knowledgeable of other village's techniques, as he was also able to recognise one of Konoha's high-level techniques at first sight, as well as how to counter it. In the anime, as a testament to Baki's strength, Kabuto expressed wanting to reincarnate Baki if he had lost his battle against Hayate Gekkō.","appearance": "Baki is a very tall man. He has two distinctive, red markings on the right side of his face (left side as well in the anime), the only visible part of his head, with the rest being covered by his turban-like head gear and by a sheet hanging from it on the left side of his face. He dons the standard attire of a Suna-nin, complete with a forehead protector and flak jacket."} 
{"character_name": "Baku","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/77/Baku_Anime.png","description": "The Baku (貘, baku) is the former personal summon of Danzō Shimura.","affiliation":"Konohagakure","background": "","ability": "In legend, the Baku is said to be able to devour dreams and nightmares, a fact that Tobi also echoed upon seeing the beast. When it opens its mouth and inhales, it can create a powerful suction force that inhales everything in its path — unaffected by the debris it inhales — while at the same time exhaling through its trunk.","appearance": "It is a gigantic elephantine chimera, large enough to dwarf Sasuke Uchiha's Susanoo. It is predominantly dark-orange in colour with the exception of its trunk, legs and the markings around its eyes. Its feet are striped — reminiscent of those of a tiger and it also has huge tusks, what looks like a beard, as well as long, sharp claws. It has bandages wrapped around its head and plated armour at the base of its trunk."} 
{"character_name": "C","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/7a/Shee.png","description": "C (シー, Shī, Viz: Shee, English TV: Cee) is a jōnin from Kumogakure, and along with his partner Darui, he served as the Fourth Raikage's support.","affiliation":"Kumogakure, Allied Shinobi Forces","background": "In the anime, when Konohagakure and Sunagakure sent an invitation for Kumogakure to join in an impromptu Chūnin Exams, the Fourth Raikage scoffed at the idea, believing it to be a joined attempt from the two villages to attack Kumogakure while its defences were lowered. A rejected the offer and sent C and Darui to make sure Killer B would not sneak off to this event.","ability": "C is a highly skilled shinobi, being chosen as one of the Fourth Raikage's bodyguards during the Five Kage Summit. He could also pressure the likes of Taka, alongside Darui and the Fourth Raikage.","appearance": "C is a young man with dark eyes and short, blond hair which he wears parted in the front. He wears the standard attire of the Kumo-nin: a sleeveless, black shirt with a one-strap-over-one-shoulder white flak jacket, black forehead protector, characteristic black, elbow-length arm-guards, and the red and white Kumogakure shin-guards along with a pair of sandals. When he joined the Allied Shinobi Forces, he switched his regular Kumo forehead protector for the one issued by the Alliance."} 
{"character_name": "Chōji Akimichi","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/7d/Ch%C5%8Dji_Akimichi.png","description": "Chōji Akimichi (秋道チョウジ, Akimichi Chōji) is a member of Konohagakure's Akimichi Clan. Though sensitive about his weight, Chōji is nevertheless dedicated to his friends, especially in Team Asuma.","affiliation":"Konohagakure, Allied Shinobi Forces","background": "Chōji was born into the Akimichi clan, and is slated to become the Sixteenth Head of the Akimichi (秋道16代目当主, Akimichi Jūrokudaime Tōshu) after his father, Chōza. When Chōji was younger, he was often put down for not being good at a child's game called 'Ninja', which appears to be a cross between tag and hide and seek, often employing the use of shuriken made out of cardboard and sticks. His peers would always berate him, telling him that any team that he was on was bound to lose. One day, they simply refused to let him play at all. However, Shikamaru Nara stuck up for him, saying that the teams would be uneven if Chōji didn't join them. This gave Chōji a little hope, although, in the end, they still refused to let him play.","ability": "Chōji's low self-confidence belied his great strength; he became agitated to fight an opponent mainly if they insulted him or his friends. It was during these instances that he proved to very strong, enough to defeat the Sound Four member, Jirōbō. His father Chōza, Shikamaru, and Asuma Sarutobi all believe that Chōji's greatest strength is his kindness and concern for his friends, which the latter states could someday make him stronger than anyone. Chōji helps fight members of Akatsuki such as Kakuzu and Pain, though his self-confidence reaches its peak during the Fourth Shinobi World War: Chōza states Chōji is now worthy of being the Akimichi clan's sixteenth head, every ally and foe on the battlefield become astonished at his display of strength, and he defeats the reincarnated Kakuzu and Hizashi Hyūga.","appearance": "Like other Akimichi, Chōji has a rotund build and markings on his cheeks in the form of swirls. He has spiky, light brown hair that sticks upward in Part I and grows to waist-length in Part II. In The Last: Naruto the Movie, Chōji cuts his hair short and sports a goatee, both of which grow further when he becomes an adult, with his hair slicked back and braided."} 
{"character_name": "Chōza Akimichi","character_pic":"https://static.wikia.nocookie.net/naruto/images/a/a8/Ch%C5%8Dza_Akimichi.png","description": "Chōza Akimichi (秋道チョウザ, Akimichi Chōza) is a jōnin of Konohagakure and former teammate of Shikaku Nara and Inoichi Yamanaka. Together they were the previous Ino Shika Chō trio. He is also the fifteenth head of the Akimichi clan (秋道15代目当主, Akimichi Jūgodaime Tōshu).","affiliation":"Konohagakure, Allied Shinobi Forces","background": "When he became a genin, Chōza was partnered with Shikaku Nara and Inoichi Yamanaka. In the anime during the Third Shinobi World War, Chōza became responsible for his own genin team, consisting of Ebisu, Genma Shiranui and Might Guy. Nearing the end of the war, his team was assigned to deliver a request for a peace treaty between Konoha and Iwagakure. Anticipating the Iwa shinobi to turn hostile, the meeting was strategically held at the borderline of the Land of Wind, knowing that the Fourth Kazekage would oversee the meeting should a battle break out nearing Suna territory. A few years later, Chōza learned that Chōji was treated as an outcast because of his weight and that he was being told by other children that the Akimichi were useless ninja. Chōza told him that one day, he would have true friends that would realise that wasn't the true Chōji. Chōza is the head of the Akimichi clan, and was part of an 'Ino Shika Chō Trio' alongside Shikaku Nara and Inoichi Yamanaka, his name being the Chō part of the group name. At some point in time before Chōji became a genin, he took him to the Yamanaka, Nara, and Akimichi Clan Memorial where he told him about the three clan's special bond and his future as the next head of the Akimichi.","ability": "Like his son and the rest of his clan, Chōza uses the special technique that allows him to change calories into chakra. As the leader of his clan, it is highly logical that he is very skilled in all of his clan's secret techniques. He was able to provide assistance to Kakashi Hatake against the Deva Path, as well as put the Asura Path out of commission for most of the battle with a single hit after it was paralysed by Kakashi's Lightning Release: Shadow Clone Technique. Like most members of his clan, he also wields a bō in battle that has the ability to lengthen in proportion to him when he grows in size, with great proficiency. In the anime, he could use the bō to create a massive whirlwind that is strong enough to not only send dozens of enemies flying, but also Chōza himself while he uses his Multi-Size Technique. While hovering, his shadow covers almost the entire battlefield, which supports the techniques of his comrade Shikaku Nara.","appearance": "Chōza is a tall, plump man with naturally brown hair, but seems to wear a long, spiky red hair-piece. He has purple markings on his cheeks — a common trait in the Akimichi clan. He wears a samurai like outfit which entails a black suit completed with armour that has the kanji for 'food' (食, shoku) on it. He also wears a rope belt, hand-guards, and instead of a forehead protector — a hachimaki tied around his head. At some point in time, he also wore a pair of silver, hooped earrings before passing them down to his son. After they were returned to him when Chōji became a chūnin and swore his oath, he has not been seen wearing them. When he uses the Multi-Size Technique two markings appear under his eyes; these markings disappear when he reverts to his normal size."} 
{"character_name": "Chōmei","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/78/Chomei.png","description": "Chōmei (重明), more commonly known as the Seven-Tails (七尾, Nanabi, Shichibi), is one of the nine tailed beasts. It was last sealed within Fū from Takigakure.","affiliation":"Takigakure","background": "Chōmei and the tailed beasts first came into being in the waning days of Hagoromo Ōtsutsuki, who used his Creation of All Things Technique to divide the Ten-Tails' chakra into nine separate bodies and giving each a name. Some time after being created, the Sage explained to the young tailed beasts that a link existed between them despite their separation. He also foretold of a day when they would be brought together again - though not as they were - and that at that time someone would emerge to show them what true power is. In the anime, before his death, Hagoromo sent Chōmei to live in a temple built for the purpose of protecting it in a closed forest region covered by mosses. At some point in the past, Chōmei became affiliated with Takigakure, making it the only tailed beast known not to belong to Five Great Shinobi Countries. In the anime, this feat is attributed to the village's reputation of frequently producing skilled jōnin. Decades later, the tailed beast would end up being sealed within Fū.","ability": "As a tailed beast, Chōmei possesses extremely large amounts of chakra that it can share with others and can use the Tailed Beast Ball. Using its wings, it can emit blinding powder and has the ability to fly. It also utilises insect-based attacks, such as biting or ramming its horn into the enemy. In the anime, it can also create a Cocoon which could slow down Chakra Absorption Techniques. It has immense durability, able to withstand being slammed into the ground by Kurama.","appearance": "Chōmei resembles a blue, armoured kabutomushi (カブトムシ, rhinoceros beetle), with six of its seven tails resembling green insect wings, along with an actual seventh tail, all growing from the end of its abdomen. The stem of the tail is green but the wings are orange. Its eyes seem to be covered by a helmet-like skull, from inside of which, an orange glow can be seen. It also has spike protrusions on its shoulders and a row of slits on each shoulder, and six legs — three on each side. The legs are also covered by the blue armour, with the exception of extreme ends which are green in colour. It has two pincers with three parts on its face, covering a mouth full of sharp teeth. On its back behind its head, it has a large two sectioned horned protrusion. During the last remaining days of the Sage of Six Paths, Chōmei was just in its larval stage of development, was completely green aside from its tails which were a lighter shade of green, having seven full tails instead of wings, and red eyes."} 
{"character_name": "Dan Katō","character_pic":"https://static.wikia.nocookie.net/naruto/images/1/13/Dan_HDshot.png","description": "Dan Katō (加藤ダン, Katō Dan) was a renowned jōnin from Konohagakure.","affiliation":"Konohagakure","background": "After the death of his younger sister, he began advocating for medical ninja to be assigned to every squad. Tsunade shared a similar belief, and the two soon began dating because of it. During their time together, Dan shared his dream of becoming Hokage with Tsunade, wanting the title so that he could better protect the villagers of Konoha. This would prompt Tsunade to give Dan her grandfather's necklace as good luck and encouragement to follow that dream. Soon after that, Dan was fighting in the Second Shinobi World War, in which he killed countless shinobi with his Spirit Transformation Technique. Ultimately, he was fatally wounded during a battle, and while Tsunade was able to stop the bleeding, it was a lost cause as the blood loss was too severe and Dan succumbed to his injuries. Tsunade would later take on Dan's niece, Shizune, as an apprentice and leave the village sometime after that, retiring from life as a shinobi.","ability": "Not much is known of Dan's abilities, but by all indications, he was a very capable and efficient ninja that served his village well. This is proven further when Kabuto reincarnated him thinking that he'd be a valuable asset on the battlefield. Kakuzu referred to Dan and Asuma as gold and silver generals (a reference to shōgi pieces), again indicating that Dan was a powerful shinobi.","appearance": "Dan had long, pale-blue hair that reached his back and dark green eyes. He wore the standard Konoha shinobi outfit of that time complete with forehead protector and the pocket-less flak jacket. After being reincarnated by Kabuto Yakushi, Dan obtained black sclerae."} 
{"character_name": "Darui","character_pic":"https://static.wikia.nocookie.net/naruto/images/4/45/Darui.png","description": "Darui (ダルイ) is a shinobi of Kumogakure and the right-hand-man of the Fourth Raikage, whom he later succeeds as the Fifth Raikage (五代目雷影, Godaime Raikage, literally meaning: Fifth Lightning Shadow).","affiliation":"Kumogakure, Allied Shinobi Forces","background": "Darui was once a student of the Third Raikage. During his training, Darui learned, among other things, the Raikage's unique black lightning technique. Along with C, he also served as the Third Raikage's support. In the anime, when Konohagakure and Sunagakure invited other villages to an unscheduled joint Chūnin Exams, the Fourth Raikage was furious at this, taking it as an underhanded scheme to attack Kumogakure. While A flatly told his men to reject Tsunade's offer, Darui informed A that he already informed Killer B of this. A quickly instructed Darui and C to prevent B, who was already on his way to leave for the exams, from attending.","ability": "Darui is a highly skilled and capable shinobi: being chosen as one of the Fourth Raikage's bodyguards and his right-hand man, as well as be placed as leader of the First Division of the Allied Shinobi Forces during the Fourth Shinobi World War. His prowess ultimately allowed him to defeat the Gold and Silver Brothers, who wielded the Treasured Tools of the Sage of Six Paths, nearly single-handedly. Years later, Darui gained a great increase in skill, which enabled him to become the Fifth Raikage.","appearance": "Darui is a fairly tall, dark-skinned man with a slightly bulbous nose, black eyes that usually look bored, and shaggy, white hair which covers his left eye. He wears a high-collared, sleeveless uniform with loose fitting pants, bandages on his wrists and the one-strap-over-one-shoulder flak jacket of a Kumogakure shinobi. Darui also has stylised characters for water (水) and lightning (雷) tattooed on his right and left shoulders respectively, denoting his chakra's nature affinities, Water Release and Lightning Release, as well as the fact that he has a kekkei genkai, the Storm Release. The tattoo on his left arm also signifies that he has inherited the Third Raikage's black lightning. He carries a broad, foldable, cleaver-like sword, strapped to his back, when outside the village. Years after the Fourth Shinobi World War and becoming Raikage, Darui became noticeably taller and muscular. He also grew a small moustache, and gained creases at the corner of his mouth, which is similar to his predecessor. While his attire was mostly unchanged, he began wearing a hood in place of the high-collar he wore before."} 
{"character_name": "Daikoku Funeno","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/75/Daikoku_Funeno.png","description": "Daikoku Funeno (ふねのダイコク, Funeno Daikoku) is a chūnin of Konohagakure where he serves as a teacher at the Academy.","affiliation":"Konohagakure","background": "When Sasuke enrolled at the Academy, Daikoku reminisces about Itachi's time as a student. He states that Itachi was the most gifted student he had ever had, and expected great things from Sasuke as well.","ability": "","appearance": "Daikoku is a fairly large man with brown hair and a goatee. He wears the standard uniform of the Konoha shinobi inclusive flak jacket and a forehead protector that he wears like a bandanna."} 
{"character_name": "Dodai","character_pic":"https://static.wikia.nocookie.net/naruto/images/9/92/Dodai_HDshot.png","description": "Dodai (ドダイ) is a jōnin shinobi from Kumogakure and an official attendant to at least two of the village's Raikage.","affiliation":"Kumogakure, Allied Shinobi Forces","background": "During the Third Raikage's reign, Dodai instructed a select group of children, informing them that only one amongst their number would earn the name 'B' and become A's tag-team partner in order to protect the future Raikage. He then instructed them on how to perform the Lightning Release: Double Lariat on a rubber training dummy, while indicating that the result would reveal their capacity to fulfil the duty of 'B'. As the prospective candidates failed one after the other, he lamented that the day seemed as though it would end in failure, until he observes A and a young Killer B decapitate the dummy.","ability": "Dodai is a highly skilled shinobi, able to teach others the basic mechanics behind the Lightning Release: Double Lariat with A while in his youth. He is also a member of the Allied Shinobi Forces Communications Team, able to patch people through directly to HQ. Dodai has shown that he can react and think very quickly in combat. Upon noticing one of the Third Raikage's attacks he immediately told his comrades to put up an appropriate defence which he then fortified. He could react to the Third Raikage's speed mid-attack, while at the same he set up a decoy for the Third to follow.","appearance": "In his youth, Dodai had short and spiky, dark-coloured hair that was largely obscured underneath a stylised forehead protector in the form of a hat. Along with this item, his typical attire consisted of the standard outfit of most Kumogakure shinobi including the distinctive single-strap flak jacket, as well as an eye patch worn over his left eye. In his old age, the contours of his face have become more pronounced and he has grown a small goatee. He wears the high-collared variant of the Kumogakure outfit along with flak jacket and his signature hat-styled forehead protector. His eyepatch now has the stylised kanji for 'lightning' (雷, kaminari) inscribed upon it."} 
{"character_name": "Dōtō Akimichi","character_pic":"https://static.wikia.nocookie.net/naruto/images/0/07/D%C5%8Dt%C5%8D_Akimichi.png","description": "Dōtō Akimichi (秋道ドウトウ, Akimichi Dōtō) is a jōnin from Konohagakure's Akimichi clan.","affiliation":"Konohagakure","background": "Dōtō was an influential person during the war between Konohagakure and Kumogakure and part of a platoon consisting of him, Minato Namikaze, Gaku Inuzuka alongside his ninken and a fourth shinobi. During one of the battles, his platoon clashed with the A B Combo. While Minato was fighting their enemies, however, the Konoha shinobi received a signal to retreat.","ability": "Dōtō was an influential shinobi during the previous war and was placed to the battlefields' front-lines for that reason, hinting towards remarkable skills. Although the full extent of his abilities are unknown, as part of the Akimichi clan, in can be assumed Dōtō can convert calories into chakra in order to perform his clan's secret techniques. He is also seemingly proficient with wielding a bō.","appearance": "Like other members of the Akimichi clan, he is very robust. He wears a samurai-like outfit with the kanji for 'food' (食, shoku) on the front, and has distinctive serpentine markings on his cheeks. He covers his long, light-brown, spiky hair with a Konoha forehead protector that he wears like a bandana. He also carries a bō."} 
{"character_name": "Eagle-Masked Anbu Member","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/7d/Eagle-Masked_Anbu.png","description": "He is an Anbu from Konohagakure.","affiliation":"Konohagakure","background": "In the anime he, Kakashi Hatake and his partner came to the aid of a Konoha lookout that was getting attacked by a group disguised as Iwagakure shinobi, with the intention to create a rift in the peace treaty between villages. Soon after they arrived, the group retreated leading Kakashi to follow them and mercilessly kill all five of the shinobi before their group could collect intel from them. He later reported back to the Fourth Hokage about the matter and how Kakashi was copping following Rin's death. During the Nine-Tailed Demon Fox's Attack, he and a group of Anbu assisted the Third Hokage with dealing with the Nine-Tails after its sudden appearance in the village. When his team launched an attack, they were all easily repelled and defeated by the Nine-Tails. Years later, he and his partner stood guard during a meeting between Konoha representatives and the Fire Daimyō. When someone interrupted the meeting, he and his partner immediately restrained the intruder.","ability": "In the anime, he was shown to be capable of phasing though solid materials. He has also shown proficiency with water, using it to create clones. He also carries a sword hinting at skill in kenjutsu.","appearance": "He has tall spiky brown hair and wears the standard attire of a Konohagakure Anbu member with a sword strapped to his back."} 
{"character_name": "Ebisu","character_pic":"https://static.wikia.nocookie.net/naruto/images/7/77/Ebisu.png","description": "Ebisu (エビス) is a tokubetsu jōnin from Konohagakure who specialises in training elite ninja. He also served as the leader of Team Ebisu, which consisted of Konohamaru Sarutobi, Udon, and Moegi.","affiliation":"Konohagakure, Allied Shinobi Forces","background": "When Ebisu became a genin, he was put on a team consisting of Might Guy and Genma Shiranui, under the leadership of Chōza Akimichi. During their Chūnin Exams, Ebisu and his team clashed with Team Minato in the Forest of Death where Guy quickly dispatched Obito Uchiha. When Kakashi Hatake is promoted to jōnin some time later, Rin Nohara gathers up the graduating class to plan a top-secret celebration which Ebisu took part in. At one point, he and his team were confronted by a generation of Seven Ninja Swordsmen of the Mist only to be saved by Might Duy.","ability": "Ebisu is an elite trainer who has an extensive knowledge in basic to advanced forms of ninja skills. According to Kakashi, Ebisu is one of the most skilled trainers in Konoha, further emphasised by him being personally selected to train Konohamaru for the Academy, and was chosen by Kakashi to train Naruto for the Chūnin Exams. Ebisu is particularly skilled in the usage of hand seals. In the anime, Ebisu is able to perform the Shadow Clone Technique and Fire Release: Fire Dragon Bullet. He has also shown to be capable in taijutsu, as seen during his battle against the Naraka Path.","appearance": "Ebisu has been portrayed as having dark hair and brown eyes and is never seen without his trademark sunglasses. Usually he is seen in the standard Konoha shinobi outfit, albeit without the flak jacket. He also wears his forehead protector like a bandanna. When deployed on missions, or if the situation calls for it he will don the flak jacket as part of his outfit. During his time in the Academy, Ebisu wore his hair swept to the sides of his face and wore a dark suit along with his signature glasses with a thin, brown shawl of sorts around his shoulders with the two ends tied. When he achieved the rank of chūnin, he discarded the shawl, donned the bandanna-like forehead protector as well as a flak jacket."} 
{"character_name": "Ebizō","character_pic":"https://static.wikia.nocookie.net/naruto/images/0/02/Ebiz%C5%8D.png","description": "Ebizō (エビゾウ), called Honoured Grandfather Ebizō (エビゾウジイ様, Ebizō-jiisama) by the Suna villagers, is highly revered in Sunagakure. He and his older sister, Chiyo, are known as the Honoured Siblings (御姉弟, Gokyōdai).","affiliation":"Sunagakure","background": "","ability": "Though little is known of his skills, it was stated that he has a strong and analytical mind that served him and Sunagakure well during the previous shinobi wars and even in his old age.","appearance": "Ebizō is an elderly man that is characterised by his heavy-lidded eyes that give him the appearance of actually having no eyes at all. He also has very long eyebrows that frame each side of his face. Along with a turban wrapped around his head, he wears the traditional Sunagakure outfit which consists of a dark coloured, loose fitting outfit with a poncho-like top."} 
{"character_name": "Enchū Nara","character_pic":"https://static.wikia.nocookie.net/naruto/images/a/a9/Ench%C5%AB_Nara.png","description": "Enchū Nara (奈良エンチュウ, Nara Enchū) is an elder adviser for the Nara clan.","affiliation":"Konohagakure","background": "Enchū has been serving as the personal adviser for the Nara Clan since before Shikaku was leader. He once pushed for Shikamaru to get into politics on the grounds that the boy's keen intellect would prove vital in diplomacy for the clan, only for Shikamaru to turn it down, finding such a career path too over-stimulating.","ability": "While unknown what his abilities are, it was noted by Shikamaru that the entire Nara clan has been very indebted to him for decades. Even more, it can be assumed as a well-respected member of the clan, he is well-versed and highly proficient in its various secret techniques of shadow manipulation.","appearance": "Enchū is an elderly man of tall height and slim built. He has noticeable wrinkles about his face and white hair with a trimmed moustache and chin-beard. He usually wears grey robes with a matching cap."} 
{"character_name": "Faz","character_pic":"https://static.wikia.nocookie.net/naruto/images/b/b2/Faz.png","description": "Faz (ファズ, Fazu) is a young citizen of the Tonika Village.","affiliation":"Tonika Village","background": "Faz was a child in Tonika Village before it was attacked. During its destruction, he was rescued by Dokku along with two others before leaving their home and meeting up with Leo and Miina along the way to Hachō Village.","ability": "","appearance": "He is a pudgy boy with short black hair and red, round cheeks. He wears casual clothings, like a simple pink shirt with grey overalls and sandals."} 
{"character_name": "Fire Daimyō","character_pic":"https://static.wikia.nocookie.net/naruto/images/d/d6/Fire_Daimy%C5%8D.png","description": "He is the former daimyō of the Land of Fire.","affiliation":" Land of Fire","background": "In the anime, a meeting with Konohagakure was convened after Hiruzen Sarutobi stepped down as the Third Hokage. Danzō strongly suggested that Orochimaru be made Fourth Hokage. Hiruzen, however, pointed out that Orochimaru had grown power-hungry and showed signs of sinister intent. Ultimately, Minato Namikaze was elected as Fourth Hokage unanimously, excluding Danzō who detested the idea.","ability": "","appearance": "He has small, circular eyes and dark pupils. He also wears the standard daimyō headpiece."} 
{"character_name": "Fugi","character_pic":"https://static.wikia.nocookie.net/naruto/images/8/87/Fugi%27s_Face.png","description": "Fugi (フギ) was a shinobi from Sunagakure.","affiliation":"Sunagakure","background": "Some time before the Chūnin Exams, Fugi had a meeting with Hōichi, discussing their plan to seal Shukaku in a tea kettle, with Gaara being the necessary sacrifice for the cause. He was impressed after hearing that the boy had studied Bunpuku's power to mould currents.","ability": "Using pre-existing sand, Fugi was capable of creating a barrier that allowed him to overwrite other active barriers, like the Sensing Barrier, in the surrounding area, creating a sandstorm in the process, which surrounds opponents and limits their sense of vision. He was carrying a tantō, implying skills in kenjutsu.","appearance": "Fugi had long, dark hair tied in a lower ponytail and dark purple-coloured eyes, along with pointed ears. He also had four tear-troughs on his face. Fugi's attire consisted of a grey tangzhuang with a buttoned-up collar and yellow markings at the hem and the sleeves, red pants, and black shoes."} 
{"character_name": "Fukasaku","character_pic":"https://static.wikia.nocookie.net/naruto/images/f/fc/Fukusaku.png","description": "Fukasaku (フカサク), often referred to as 'Head' (頭, Kashira) is an elder toad over eight hundred years old that resides on Mount Myōboku. As the heirs of the Great Toad Sage, he and his wife Shima are revered as the 'Two Great Sage Toads' (二大仙蝦蟇, Nidaisengama).","affiliation":"Mount Myōboku, Konohagakure","background": "When Jiraiya accidentally reverse-summoned himself to Mount Myōboku, Fukasaku greeted the young shinobi and stated that the Great Toad Sage was expecting him. Some time after this, Fukasaku taught Jiraiya senjutsu. Fukasaku was later present when the Great Toad Sage called for Jiraiya to tell him about his prophecy.","ability": "In battle, Fukasaku and Shima are extremely formidable. After Shima extends a serpent-like creature from her stomach to seek out the opponent, Fukasaku can quickly strike with his tongue. Both are capable of exerting powerful gusts of wind. Also, they are highly intelligent, as they quickly determined a weakness in the way Pain used his Rinnegan.","appearance": "Fukasaku is a green toad with white hair styled in somewhat of a mohawk, very thick eyebrows and a small goatee. He has been seen wearing two capes: a high-collared one and a simpler version. On his back is a message that Jiraiya left before he died regarding Pain: 'the real one isn't among them'; because it was burned into his flesh, it cannot be removed."} 
{"character_name": "Fū Yamanaka","character_pic":"https://static.wikia.nocookie.net/naruto/images/9/95/Fu_1.png","description": "Fū Yamanaka (山中フー, Yamanaka Fū, Viz: Foo) was a shinobi from Konohagakure's Yamanaka clan, as well as a high-ranking shinobi of the disbanded Anbu faction Root.","affiliation":"Konohagakure, Root","background": "In the anime, Fū was among many promising young children from various clans of Konohagakure that was personally selected and recruited by Danzō Shimura to join Root, much to the dismay of Inoichi Yamanaka. His training was directly under Danzō's supervision. Later, already well-adjusted to the workings of Root, he was paired up with the newly recruited Torune. Despite some mild mocking on Fū's part, he was tasked with instructing Torune with the workings of Root. Ultimately, the two formed a strong and long-standing friendship.","ability": "Danzō stated that he and Torune were two of the most-skilled ninja in Root. Fū was a skilled sensor, able to detect that he, Torune and Danzō were still being pursued by Ao. He could instantly sense when Tobi emerged behind him and act immediately. In the anime, Fū proved to be skilled in taijutsu as a child, able to skilfully deflect a young Torune's attacks without being infected by his rinkaichū. As an Anbu, Fū was also versed in kenjutsu, wielding a tantō to deliver quick slashes.","appearance": "When first introduced, Fū's appearance was that of a regular Konoha Anbu, with a white cloak and mask. When he removed the mask, it was revealed that he was a young man with auburn coloured hair and amber eyes. He wore a short, black jacket with red straps on the shoulders like all members of Root which most likely shows allegiance to the organisation. He also wore a red short kimono under the jacket with a black sash, a pair of black gloves, dark-coloured pants, and regular shinobi sandals. As a child in Root, he wore a light brown short kimono with a black sash, grey pants and shinobi sandals. Fū also wore black wristbands on his wrists."} 
{"character_name": "Gaara","character_pic":"https://static.wikia.nocookie.net/naruto/images/2/20/Gaara_in_Part_I.png","description": "Gaara (我愛羅) is a shinobi of Sunagakure and the youngest of the Three Sand Siblings. He was made the jinchūriki of the One-Tailed Shukaku before he was born, causing the villagers of Suna to fear him as a monster. With nobody to connect to, Gaara grew up hating the world and looking out only for himself, giving his life meaning by killing anyone he came across. After being defeated by Naruto Uzumaki — a jinchūriki like himself who found strength in his friendships — Gaara began emulating him. He later became Suna's","affiliation":"Sunagakure, Allied Shinobi Forces","background": "Because of heavy cuts to Sunagakure's budget by the Wind Daimyō, the Fourth Kazekage wanted to make one of his children the jinchūriki of the tailed beast Shukaku to serve as a weapon for the village. His first two children, Temari and then Kankurō, had not been compatible with Shukaku. Rasa's third child, however, Gaara, was compatible with Shukaku. For that reason, Shukaku was sealed inside of Gaara by Chiyo before he was even born, when Gaara was still a fetus inside of his mother Karura's womb. Gaara ended up being born prematurely and from the ordeals of childbirth, his mother, Karura, died. Before dying, Karura looked lovingly at Gaara's small form and vowed to always protect him. Gaara was raised in isolation during his early life, taught ninjutsu by his father and cared for by his maternal uncle, Yashamaru. When he was allowed to roam around the village, Gaara would try to connect with the villagers, being kind to them and offering them any assistance he could. However, being a jinchūriki made the villagers frightened of Gaara; adults avoided him and, when they couldn't, treated him delicately while children would run from him on sight. Gaara would try to assure them he meant no harm, but in the process would inadvertently injure or even kill them with his sand. Gaara did not understand this pain he caused others because his sand protected him from all injury. When he was six years old, Gaara asked Yashamaru to explain pain to him. From Yashamaru's explanation, Gaara believed he did know pain: the unbearable agony in his heart. From this, Yashamaru elaborated that physical pain, what causes one to bleed, could be cured with medicine and time, whereas pain of the heart, like Gaara experienced, could only be cured with love. Gaara, said Yashamaru, received love everyday, from both his mother - whose spirit controlled the sand that protected him - and from Yashamaru himself. Gaara was pleased by this and went out into the village to show some love to those he'd harmed, but his efforts were met only with more fear and hate. Gaara was dismayed and went off to try and understand why he was treated as such a monster. While doing so, he was attacked by one of Suna's Anbu, whom he fatally wounded with his sand. When he unmasked the Anbu, Gaara discovered it was Yashamaru. Gaara was devastated that Yashamaru, the only living person to love him, would try to kill him and asked for an explanation. Yashamaru replied that it was a mission given to him by Rasa, Gaara's father, it having been decided by the Suna Council that Gaara was a failed experiment that, if allowed to live, would only continue to do harm to the village and its people. Gaara tried to find solace in the fact that Yashamaru had been ordered to kill him, but Yashamaru insisted, lying to Gaara that he volunteered and that he'd always hated Gaara for causing Karura's death. Karura had not loved Gaara either, and named him after the phrase 'a self-loving carnage' (我を愛する修羅, Ware o aisuru shura) so that he would be a curse upon Suna for what it had done to her. With his explanation done, Yashamaru asked Gaara to 'please die' before blowing himself up with explosive tags.","ability": "Having been trained since infancy as Suna's 'ultimate weapon', Gaara was exceptionally strong even as a child, effortlessly killing the countless assassins sent after him. As a genin, he became known internationally for completing B-rank missions. He also set the record time of completing the Chūnin Exams in the Forest of Death, and unscathed; a feat normally incapable for a chūnin. By Part II, Gaara becomes Suna's Fifth Kazekage, tasked with leading and protecting the entire village. His fellow Kage initially doubted his worthiness due to his young age, but come to respect him by the Fourth Shinobi World War, where he was appointed the commander-in-chief of the Allied Shinobi Forces' combat divisions. The reincarnated Kage that Gaara fought, including his father, also came to approve of his abilities after he defeated them. He could hold his own against five of Madara Uchiha's Susanoo-clad wood clones for some time. As an adult, Gaara's prowess had grown to the point where he could hold his own against opponents of the Ōtsutsuki Clan, including Momoshiki and Urashiki Ōtsutsuki. Fighting alongside Shukaku, he was able to hold off and eventually seal Urashiki temporarily while in battle.","appearance": "Having been trained since infancy as Suna's 'ultimate weapon', Gaara was exceptionally strong even as a child, effortlessly killing the countless assassins sent after him. As a genin, he became known internationally for completing B-rank missions. He also set the record time of completing the Chūnin Exams in the Forest of Death, and unscathed; a feat normally incapable for a chūnin. By Part II, Gaara becomes Suna's Fifth Kazekage, tasked with leading and protecting the entire village. His fellow Kage initially doubted his worthiness due to his young age, but come to respect him by the Fourth Shinobi World War, where he was appointed the commander-in-chief of the Allied Shinobi Forces' combat divisions. The reincarnated Kage that Gaara fought, including his father, also came to approve of his abilities after he defeated them. He could hold his own against five of Madara Uchiha's Susanoo-clad wood clones for some time. As an adult, Gaara's prowess had grown to the point where he could hold his own against opponents of the Ōtsutsuki Clan, including Momoshiki and Urashiki Ōtsutsuki. Fighting alongside Shukaku, he was able to hold off and eventually seal Urashiki temporarily while in battle."} 
{"character_name": "Gamariki","character_pic":"https://static.wikia.nocookie.net/naruto/images/c/c0/Gamariki.png","description": "Gamariki (ガマ力) is a toad from Mount Myōboku.","affiliation":"Mount Myōboku, Konohagakure","background": "After setting off to train with Jiraiya, Naruto was first trained to recognise and disperse genjutsu. In order to do this, Jiraiya summoned Gamariki who used his Genjutsu Kiss on him, sending him into a world of illusions. In attempting to release the genjutsu, Naruto unintentionally ended up releasing chakra much in the same manner as his Rasengan, knocking Gamariki into a canal and knocking him out. It was revealed that this was the reason the two dislike each other.","ability": "Gamariki is quite the capable toad, being able to restrict or knockout an opponent with his Whip of Love. He can utilise the Water Release nature transformation to use techniques such as the Water Release: Water Gun, which he could use in conjunction with his summoner to produce a more devastating attack. He has also shown to be proficient in genjutsu, being able to catch targets with them by kissing them, and sending them into a world of hallucinations.","appearance": "Gamariki is light green in colour with purple eyes and yellow patterns all over his body and wears a large red violet bow on his back and make-up which includes red lipstick, pink blush on his cheeks and eye-liner. All this gives him an effeminate appearance, making him the toad equivalent to a drag queen. Curiously, he more closely resembles a frog rather than a toad."} 
{"character_name": "Ginkaku","character_pic":"https://static.wikia.nocookie.net/naruto/images/0/03/Ginkaku_268.png","description": "Ginkaku (銀角) was one of Kumogakure's Gold and Silver Brothers alongside Kinkaku, who were the most notorious criminals in the history of their village.","affiliation":"Kumogakure","background": "During the First Raikage's reign, the Gold and Silver Brothers were part of a team that was assigned to capture the Nine-Tailed Demon Fox, but the two were swallowed during the confrontation. However, they survived by eating the flesh of the beast, and thrashed inside the tailed beast's stomach for two weeks, eventually forcing the Nine-Tails to regurgitate them. Upon their escape, they both came out looking like miniature versions of the beast, due to having acquired a portion of the fox's chakra. During a peace treaty ceremony between Konohagakure's Second Hokage and Kumogakure's Second Raikage, the two brothers staged a coup d'état that left the Hokage on the brink of death. At some point, he met Kakuzu, and he was still alive during the time of Third Raikage.","ability": "Ginkaku and his brother are well known for their prowess during their lifetime, so much to make others tremble in fear at the sight of them decades after. The pair's reputation from acts such as leaving the Second Hokage on the brink of death, earned themselves the awareness of the Fourth Raikage, who considered the two such a threat even against several thousands shinobi. Being descendants of the Sage of Six Paths, it was believed this allowed them to survive eating Tailed Beast flesh. From doing this, he gained access to the Nine-Tails chakra, resulting in him being able to enter both version 1 and 2 forms.","appearance": "Ginkaku, like his brother, was a relatively burly shinobi, albeit smaller than his sibling. He had light-coloured eyes with dark-coloured sclera, grey-toned skin (depicted as fair-coloured in the anime), as well as long, silver hair cover with prominent dark tips, arranged in a style reminiscent of a Native American headdress. These features are accentuated by the presence of two distinctive horns on his head as well as a light-coloured rectangular marking on his nose. He also had the same characteristic whisker-like marks on his face as Naruto Uzumaki. His typical attire was comprised of a standard Kumogakure flak jacket that is black on the edges, worn over a purple, high-collared, sleeveless uniform, a purple forehead protector, and a pair of simple wrist-guards. The kanji for 'silver' (銀, gin) was tattooed on his right shoulder. Along with this, he typically carried a large gourd around his neck attached to a thick rope."} 
{"character_name": "Han","character_pic":"https://static.wikia.nocookie.net/naruto/images/3/3c/Han.png","description": "Han (ハン) was a shinobi from Iwagakure and the jinchūriki of the Five-Tails, Kokuō.","affiliation":"Iwagakure","background": "During the Third Shinobi World War, Han became known worldwide for his prowess with steam ninjutsu. In the middle of the war on the battlefront, he and the Four-Tails's jinchūriki Rōshi confronted Team 6, during which they launched their Tailed Beast Balls, but missed when Minato Namikaze warped the Konohagakure squad to safety. At some unspecified time in between the war and the capture of Yugito Nii, Han died, as by the time the Two-Tails was sealed, according to Pain only three tailed beasts remained uncaptured. It's unclear if he was captured by the Akatsuki and had the Five-Tails extracted from his body leading to his death, an incident that Iwagakure would have not alerted others of out of embarrassment, or similar to Yagura Karatachi died and the group went on to capturing his roaming Tailed Beast. Ultimately, sometime after his death, Kabuto Yakushi acquired some of Han's DNA, which he used to reincarnate him.","ability": "Han was recognised worldwide for his prowess with steam ninjutsu due to his war efforts, and his speed in taijutsu during his lifetime was considered the greatest in the world. He was also notable enough to be reincarnated by Kabuto Yakushi. After his reincarnation and serving as one of Tobi's Six Paths of Pain, Han is seen with both the Sharingan and Rinnegan. Combining the perceptual and predictive abilities of the former with the shared field of vision ability of the latter, allowed Han to use his attacks in a more precise and coordinated fashion as well as react to enemy attacks more efficiently, both individually and in conjunction and with the other jinchūriki.","appearance": "Han was a very tall man, seen as the physically largest jinchūriki, easily standing a head taller than Killer B. He was also heavily armoured, wearing what is called Steam Armour with a furnace on the back that emits steam. He had light brown eyes, was eyebrowless, and his armour extended all the way to the bottom half of his face, covering it up. Underneath the armour covering the bottom half of his face, he wore a white cloth which also covered both sides of his face and the top of his head. Aside from his red armour, he also wore a red kasa (conical straw hat) over the white cloth and it seems to be composed of the same material of his armour and furnace. He wore his Iwagakure forehead protector on a black cloth, and over his armour, Han wore a black gi, with the sleeves seemingly torn off and black gloves. He also wore what seems to be a bronze-coloured ring around his neck which he wore over his red armour. Also, the armour covering his arms, legs and torso was plated."} 
{"character_name": "Hamura Ōtsutsuki","character_pic":"https://static.wikia.nocookie.net/naruto/images/e/e8/Hamura.png","description": "Hamura Ōtsutsuki (大筒木ハムラ, Ōtsutsuki Hamura) was the son of Princess Kaguya, the fraternal twin brother of Hagoromo; both of whom were the first people born with the ability to wield chakra. Hamura was the ancestor of the Hyūga clan and the founder of the shinobi of the Moon.","affiliation":"Land of Ancestors, Mount Myōboku, Moon","background": "Hamura was born as the younger of Kaguya Ōtsutsuki's twin sons, the first people to be born with chakra. When Kaguya realised both Hamura and Hagoromo also had the ability to wield chakra, Kaguya — as the Ten-Tails — tried to forcibly reclaim her chakra out of rage and jealousy. Eventually, Hagoromo and Hamura succeeded in defeating and sealing her within Hagoromo. Some time later, Hagoromo created the tailed beasts and extracted the Ten-Tails' husk from his body and sealed it into the moon, resulting in his death. Sometime later, Hamura and the rest of the clan departed to the moon, in order to guard his mother's sealed remains, though not before receiving instructions from his brother to wait for a full millennium and observe mankind. There, he used the power of the Tenseigan to bring order and stability to the world of the Moon. Decades later and having grown elderly, Hamura passed away in bed surrounded by his clan members.","ability": "One of the most powerful figures in history, Hamura was able to defeat the Ten-Tails in battle together with his brother. During battle, Hamura wielded a sword with presumable proficiency as well as a shakujō. He was also noted to have inherited his mother's powerful chakra. Hamura, like his brother, was capable of transcending time well after his death to talk with others and likewise bestow power to them, using his chakra to manifest his form even centuries after his death.","appearance": "Hamura was a tall and pale-skinned man with hairless brow ridges and white hair, which was short in his adolescence but later grew to waist-length. His bangs were short hung to left side of his face with a chin-length lock which hung from the right side of his face. He also had small, horn-like protrusions on his forehead and inherited the renowned Byakugan in both of his eyes from his mother. He wore a light, full-length kimono with a pattern of six black magatama around a high collar and dark pants. He had his sword in its sheath strapped to his left hip. He also had a dark crescent-moon representing Yin mark in his left palm."} 
{"character_name": "Hebiichigo","character_pic":"https://static.wikia.nocookie.net/naruto/images/e/ed/Hebiichigo.png","description": "Hebiichigo (蛇苺) was a kunoichi from Kirigakure.","affiliation":"Kirigakure","background": "Hebiichigo was an orphan with no memories of her family. She grew up on a trash heap outside of Kirigakure. She would scrounge the area for anything of remote value. During this time, she learned to sew, finding a real pleasure in it even when others found it a waste of time and resources. One day, a missing-nin chanced on the area and attacked her. Desperate to live, she used a pole to kill them. Being praised for her efforts by a Kiri-nin, Hebiichigo made the decision to become a shinobi herself.","ability": "Hebiichigo had quite proficient with long-range combat, shown by her ability to effectively use Nuibari to restrain her foes in its strings. However, due to her preference to such distance in combat, she was vulnerable to close-range combat. Outside combat, she was also a skilled seamstress, able to quickly mend tears in clothing.","appearance": "Hebiichigo was a short young woman with long grey hair that is kept back with a forehead protector. She wore a red, pinstriped jumper that reached to her ankles in length, and was too big for her arms to fit, leggings of the same colour and flat heel shoes. After Shizuma's declaration of war, she donned a sleeveless black jinbaori war coat with tan lining and grey hemming, worn in the style of an open vest."} 
{"character_name":"Iggy","character_pic":"https://static.wikia.nocookie.net/naruto/images/0/0e/Iggy.png","description": "Iggy is a citizen of the Land of Water.","affiliation":"Land of Water","background": "During his childhood, Iggy made one friend with a boy named Banna because the latter was being picked on due to his appearance.","ability": "Though not much is known of his abilities, he was seemingly proficient enough in kenjutsu to wield one in battle. He has also shown some aptitude at ambush tactics, being able to successfully track and use kunai with explosive tags attached against targets and even managed to extract Banna safely from his captors.","appearance": "Iggy has a short, green hair, brown eyes and a pointed chin. His hair also framed the sides of his face in a similar manner to sideburns. He usually wears a long-sleeved blue outfit with a flap on the front and the back and gold trimmings, a pair of white gloves, sandals, baggy pants that was tapered off by bandages and a hat giving him the overall look of a bellhop. While dressed in his ninja outfit he retains the same pants but wears a jacket over a mesh shirt with elbow guards and a pair of black gloves. He also carried a sword on his back, wore an unmarked forehead protector around his head and carried a shuriken holster."}
{"character_name":"Iwa Doctor", "character_pic":"https://static.wikia.nocookie.net/naruto/images/f/ff/Iwa_Doctor_Infobox.png","description": "The Doctor (ドクター, Dokutā) was an Outer of Kara who worked for Victor's company in the Land of Valleys. Wanting to elevate his position, he secretly worked with the retired Third Tsuchikage Ōnoki to create the Fabrications and Akuta.","affiliation":"Iwagakure,Kara","background": "As an Outer of the secret organisation, Kara, the doctor worked under Victor in an unauthorised project to recreate the God Tree from a splinter recovered during the Fourth Shinobi World War. Wanting to elevate his own social status, the doctor proceeded with his own personal agenda by acquiring genetic material from the White Zetsu sometime after the war, in order to attain additional data for Kara's cause. One day, he approached Ōnoki, whose hopes to create artificial soldiers to replace the shinobi of Iwagakure backfired, to offer his services with the material he obtained. With it, they created the Fabrications, artificial humans to help lead the Akuta, mindless soldiers created from clay. To lead the Fabrications themselves, the doctor and Ōnoki created a Fabrication clone of the Tsuchikage himself, Kū.","ability": "The doctor was very intelligent, being able to use the genetic materials acquired from White Zetsu to create artificial lifeforms, the Fabrications, and even integrate them with certain genetic anomalies to grant them advanced nature transformations. He could also use a fragment of the God Tree, combined with Hashirama's Cells, to cause an artificial God Tree to blossom.The doctor's scientific ingenuity did have its limitations, as his creations were flawed with unstably short lifespans and durability. He managed to overcome this flaw by examining Mitsuki, a different type of artificial human (limited by a cursed seal that he cannot get through), though it requires a human to be sacrificed in the process, which defeats the very purpose of having Fabrications to protect humanity to begin with. Also, his artificial God Tree could not beget a Chakra Fruit, instead having created a tree that simply absorbed chakra from every living beings within reach.Despite having his heart torn out by Kū, he somehow managed to come back to life.","appearance": "The doctor had an oval face with thick grey hair on the sides, but bald on the top, and a toothbrush moustache. He had narrow eyes with wrinkles under them, and creases around his mouth area.He wore a white lab coat over a dark navy turtleneck and pants, and a monocle over his right eye."}
{"character_name":"Iō", "character_pic":"https://static.wikia.nocookie.net/naruto/images/c/cc/I%C5%8D.png","description": "Iō (イオウ) is a ninja weapon inventor from Konoha. He and his assistant, Shōseki, help make weapons for the village.","affiliation":"Konohagakure","background": "Most of his original weapons are shown to either be impossible to carry or serve no purpose at all. It is assumed he was relocated to the outskirts of the village due to the random explosions he creates, which he claims are 'challenges' during his inventing.","ability": "He is very knowledgeable in the art of creating ninja tools, able to create unorthodox yet dangerous weapons like Tsurukame, Dakō or Jidanda, showing a high level of technical knowledge. However, most of these unorthodox inventions are useless for combat. He has also shown rather skilled at laying traps, as well as proficiency with the Enclosing Technique, using it to store some of his creations.","appearance": "Iō is a small, balding man with grey hair, a small moustache and goatee. He wears a pair of gloves with bandages around his arms, a high-collared jacket, black trousers, sandals and a blacksmith's apron with the village symbol on it."}
{"character_name":"Jinpachi Munashi", "character_pic":" https://static.wikia.nocookie.net/naruto/images/4/4c/Jinpachi_Munashi.png","description": "Jinpachi Munashi (無梨甚八, Munashi Jinpachi) was a jōnin from Kirigakure and a member of the previous generation of the Seven Ninja Swordsmen of the Mist.","affiliation":"Kirigakure","background": "In the anime, according to Kakashi Hatake, Jinpachi committed many acts of cruelty in his lifetime, killing his older brother being one of them.","ability": "As one of the Seven Ninja Swordsmen of the Mist, Jinpachi was one of the most powerful shinobi produced within Kirigakure. Jinpachi's generation of swordsmen were also noted to be the strongest in the village's history. He is also skilled with the Silent Killing technique.","appearance": "Jinpachi had long, brown hair, a long beard which he wore in strands adorned with beads and his lips were also noticeably dark in colour. The top of his head was wrapped in bandages, and he had an eye-patch covering his left eye, sprouting from under his Kirigakure forehead protector. His right eye has been depicted as being violet in the anime,and he wore an extremely loose, long-sleeved pin-striped shirt and black pants, accentuated by the presence of striped leg-warmers matching his shirt. Like the other members of his generation of swordsmen he also wore bandages around his neck."}
{"character_name":"Jūgo", "character_pic":" https://static.wikia.nocookie.net/naruto/images/4/42/Jugo.png","description": "Jūgo (重吾) is a shinobi from an unnamed clan, who was being held at Orochimaru's Northern Hideout. He was said to have gone to Orochimaru of his own free will, hoping that Orochimaru would cure him of his rages. He was later recruited as a member of Sasuke Uchiha's group Taka, which was initially called 'Hebi' at the time of its creation.","affiliation":" Otogakure,Akatsuki","background": "An outcast, Jūgo's rage made him a danger to anyone around him, as they stood little chance of survival should he lose his temper. At one point, he became so angry that he destroyed a village and killed all of its inhabitants. This has caused others to label him as the 'Scales', where anything could tip the balance. Cursing his existence, he took to secluding himself in caves, hoping to bring no one any harm. This lasted until he met Kimimaro, who was himself the last remnant of the Kaguya clan. Following Kimimaro, Jūgo allowed himself to be one of Orochimaru's test subjects in the hopes that he could be cured of his fits of rage.However, amazed by Jūgo's ability to absorb natural energy to undergo various drastic physical alterations at the cost of mental state, Orochimaru's attempts to discover the origin of his clan's ability to use such power led him to the Ryūchi Cave, where he learned to use Senjutsu. Unable to enter Sage Mode, Orochimaru instead devised the cursed seals by combining his Senjutsu chakra and the mutative enzymes he isolated from Jūgo's blood.As Orochimaru was nearing time to swap vessels, Kimimaro took it upon himself to recover Sasuke Uchiha. Prior to leaving, Jūgo was visited by Kimimaro who explained the situation to him. Despite Jūgo's concerns for Kimimaro's health, he assured him that Sasuke is his legacy while thanking Jūgo for their friendship.","ability": "Jūgo's abilities undoubtedly make him a dangerous individual, enough to gain the interest of other powerful ninja such as Orochimaru and Sasuke Uchiha at separate times. After adapting their DNA and abilities, Kabuto also indirectly praised Jūgo when noting the quality of Sasuke's former team. A special trait of Jūgo's, is his ability to understand and communicate with animals, such as birds, who can be sent to travel far distances to scout and gather information,and quickly report back. Jūgo can also transfer his chakra onto others, as seen when he infused Sasuke's Susanoo with senjutsu chakra,and in the anime absorb chakra through physical contact and heal most injuries instantly.Jūgo's nature transformations include Earth, Water, Wind, and Yang Release.","appearance": "Jūgo is a very tall, muscular young man who has spiky orange hair, red-orange eyes, and a usually calm disposition. However, when affected by his murderous side, his skin turns dark, his irides become a pale yellow colour while his sclerae turn black, and he grows various weapons and appendages to suit his battle combat situation, as well as having a deranged look. Jūgo has a bracket-shaped symbol on his left palm.As a child, he wore a yellow shirt with blue shorts. When Jūgo was first introduced, he wore a pale blue shirt and pale green shorts. Later when Tamaki tried to find him some clothes, he wore black pants, a purple curtain he wore as a cape (Tamaki not able to find a shirt big enough for him), and brown sandals. After Taka had allied with Akatsuki, Jūgo was shown wearing an Akatsuki robe.Years later while working for Orochimaru, he developed a stronger jawline and dons his hair in an up-do while keeping the sides short. Attire-wise he wears a ragged, dark-coloured cloak."}
{"character_name":"Jiji", "character_pic":"https://static.wikia.nocookie.net/naruto/images/6/67/Jiji.png","description": "Jiji (ジジ) is a prisoner at the Astronomy Research Institute.","affiliation":"SunagakureLand of Redaku","background": "Jiji was originally a ninja of Sunagakure. A few years prior to the events of Sasuke Retsuden, the Prime Minister of the Land of Redaku visited the village while he was touring the region. While there, he hired Jiji to come to Redaku and train an army of ninja, as Redaku was historically a peaceful country with no combat experience. Jiji travelled to Redaku's capital city and was given a room in the royal palace; one of the palace maids, Margo, was assigned to attend to him. Over time, Jiji and Margo fell in love, with Jiji deciding to abandon the life of a ninja in order to be with her.","ability": "Because of Jiji's ability to revive and control dozens of reincarnated dragons simultaneously, as well as the fact that he concealed his identity as a ninja for so long, Sasuke concluded Jiji must be a very talented ninja. He is shown to coat his weapons with a poison unique to Redaku: those exposed to the poison have their chakra pathway system temporarily shutdown, preventing them from being able to move.","appearance": "Jiji is described as being the same age and of a similar physique to Sasuke Uchiha."}
{"character_name":"Jōseki", "character_pic":"https://static.wikia.nocookie.net/naruto/images/e/ec/J%C5%8Dseki.png","description": "Jōseki (ジョウセキ) is a Senior from Sunagakure.","affiliation":"Sunagakure","background": "With the village believing Gaara, the jinchūriki of the One-Tail Shukaku was a failure, Jōseki noted that they needed to depend on the Fourth's development of new techniques and the trading of gold to keep their economy from crumbling. After making this announcement, he noted that they needed to deal with Gaara as well.","ability": "As a member of the advisory council, he is most likely one of Sunagakure's wisest shinobi.","appearance": "Jōseki's face was noticeably lined with deep tear troughs and ones running parallel to his nose. Attire wise he wore the standard uniform of the Sunagakure Seniors along with a turban. He also has black hair and dark-coloured eyes."}
{"character_name":"Kae Yukiwari", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/4a/Kae_Yukiwari.png","description": "Kae Yukiwari (雪割カエ, Yukiwari Kae) is an exchange student to the Konohagakure Academy and the princess of the Land of Bamboo.","affiliation":"Konohagakure","background": "As future heir to the throne, Kae had been required to act in a manner that befitted her status. Due to that, she did not get a chance to make friends, instead spending her time only with her younger stepbrother during her childhood.Kae was very close to her late mother. She would often attend parties hosted and prepared by the queen. As Kae voiced her admiration of her mother, she encouraged Kae to make sure she does things her own way, and looked forward to attending a party hosted by Kae.","ability": "In her efforts to emulate her late mother, Kae is a talented party planner and host, including personally making tea and cake. After enrolling in the Academy in Konohagakure, Kae was able to learn skills like Tree Climbing Practice, but in her excitement, she was unable to keep her focus, almost falling from the tree.","appearance": "Kae is a fair-skinned girl of average height who is considered very pretty. She has blue eyes and grey-blond hair tied in a left-side ponytail with upward curves strands framing the sides of her face and short bangs splitting in the centre of the forehead. She wears white clothing lined with blue on the collars with grey pants and white sandles.While appearing formally as a princess, she wears a blue, long-sleeved qípáo-like garment with dark blue and light blue linings, two grey necklaces, one of which has a pendant, and a simple necklace-like accessory across her forehead with a small pendant hanging over it."}
{"character_name":"Kagura Karatachi", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/4a/Kagura_Karatachi.png","description": "Kagura Karatachi (枸橘かぐら, Karatachi Kagura) was a shinobi from Kirigakure, who worked as an aide to the Sixth Mizukage, and a special advisor of the village.Striving to turn Kiri into a village that rivals Konohagakure, he became a prison warden so he could nurture people more.","affiliation":"Kirigakure","background": "Being the grandson of Yagura, people kept their distance from him. As his safety couldn't be guaranteed, he was relocated to a small village outside of Kirigakure. There, he initially spent his time practising his kenjutsu on a tree, or pulling pranks about the village, often being spanked as a punishment. Eventually, the children began warming up to him and let him play with them.","ability": "Kagura was a genius shinobi who despite his young age has earned a reputation known across the shinobi world.In the Academy, his prowess was shown to be especially high, swiftly defeating all his opponents in matches. As such, Chōjūrō wanted Kagura to eventually succeed him as Mizukage, a position reserved only for the strongest shinobi of their village. Later, his talents made him the warden of a top-level prison complex.","appearance": "Kagura was a teenager of average height. He had a fair complexion with short, messy, grey hair that falls over the right side of his face and spiked up on the left his forehead, pink eyes and a marking with three points running down under his left eye. Overall, he bore a striking resemblance to his grandfather, Yagura. He was very handsome as nearly all the Konoha Academy female students immediately swooned for him.He wore black pants, a striped purple shirt, a green long-sleeved vest with a high collar, and black gloves. He also wore a grey-strapped forehead protector under his bangs. He carried at his hip a wooden katana with a square hollow hilt. Attached to the top of the scabbard was a Kagemasa key-chain shaped like the movie-star's signature visors.Later, while working as the warden of a Kiri prison, he wore a formal, short-sleeved blue shirt with yellow shoulder straps and blue pants with black gloves. He also stopped wearing his forehead protector. He also replaced his wooden sword for a proper metal one."}
{"character_name":"Kakoi", "character_pic":"https://static.wikia.nocookie.net/naruto/images/7/73/Kakoi_infobox.png","description": "Kakoi (カコイ) is a member of the Konoha Barrier Team.","affiliation":"Konohagakure","background": "When someone unknown penetrates into Konoha and was able to pass through a special barrier, Kakoi arrives at the Third Hokage along with Kakashi Hatake, and informs the latter about the penetration, giving him a map where the area of the stranger's arrival - the Uchiha region - was marked. The Third Hokage assigns Kakashi a mission to monitor the area.","ability": "By using Water Release, Kakoi was able to erect an immense Sensing Barrier with the help of others, which allowed him to monitor the situation in Konohagakure.","appearance": "Kakoi has shoulder-length brown hair and unique markings under his eye. He wears a high-collared white tunic and white hat."}
{"character_name":"Kankitsu Akitsuki", "character_pic":"https://static.wikia.nocookie.net/naruto/images/6/6b/Kankitsu.png","description": "Kankitsu Akitsuki (明月カンキツ, Akitsuki Kankitsu) is Remon Yoimura's distant relative and fiancé.","affiliation":"Daidai Village","background": "When they were little, Kankitsu and Remon grew up together. Sometime later, when Kankitsu reached the age of twenty, a curse mark appeared on his right palm. In order to subdue the curse for another hundred years, Kankitsu was ultimately betrothed to Remon. When he visited the Yoimura household to discuss the date for the wedding ritual, Kankitsu was lured and tricked by Sōma to touch its rock, where the demon possessed him into doing their bidding. This made him become cold toward Remon.","ability": "While possessed by Sōma, Kankitsu was able to produce a white aura with which he could steal one's memories upon physical contact. Alternatively, he could unleash his energy as blasts to steal people's memories from afar.","appearance": "Kankitsu has red shaggy hair and beige eyes with black pupils and a pale complexion. He wears a black business suit with a grey collared dress shirt and a light violet necktie. When he was manipulated by Sōma, his eyes were blank and pupilless."}
{"character_name":"Kinkaku", "character_pic":"https://static.wikia.nocookie.net/naruto/images/f/f4/Kinkaku_268.png","description": "Kinkaku (金角) was one of Kumogakure's infamous Gold and Silver Brothers, and a member of the Kinkaku Force.","affiliation":"Kumogakure","background": "During the First Raikage's reign, he and Ginkaku were part of a team that was assigned to capture the Nine-Tailed Demon Fox, but the two were swallowed during the confrontation. However, they survived by eating the flesh of the beast, and thrashed inside the tailed beast's stomach for two weeks, eventually forcing the Nine-Tails to regurgitate them. Upon their escape, they both came out looking like miniature versions of the beast, due to having acquired a portion of the fox's chakra.During a peace treaty ceremony between Konohagakure's Second Hokage and Kumo's Second Raikage, the two brothers staged a coup d'état that left the Hokage on the brink of death.During the First Shinobi World War, the Kinkaku force cornered the Second Hokage and his Escort Unit an altercation which ended in Kinkaku killing the Hokage. At some point, he met Kakuzu, and he was still alive after the appointment of the Third Raikage. For his crimes, he became one of the most notorious criminals in the history of Kumo.","ability": "The Gold and Silver Brothers were well-known for their prowess, causing a shinobi to tremble in fear when he saw them, and nearly lead the Fourth Raikage to disregard his duties as leader of the Allied Shinobi Forces in order to personally confront the pair. Alongside Ginkaku, he was capable of nearly killing Tobirama, and with the Kinkaku force, managed to kill him. Kinkaku's power alone nearly demolished the entire First Division and inflicted massive casualties.Being a descendant of the Sage of Six Paths,it was believed this allowed him to survive eating Tailed Beast flesh.","appearance": "Kinkaku was a burly shinobi with a muscular build and towering stature. He had light-coloured eyes with dark-coloured sclera,grey-toned skin (depicted as fair-coloured in the anime),as well as long, blond hair with prominent dark tips, arranged in a style reminiscent of a Native American headdress. These features are accentuated by the presence of two distinctive horns that emerge from the abundant hair on his head, as well as a rectangular marking on his nose. He also had whisker-like marks on his face.His typical attire comprises of a standard Kumogakure flak jacket that is black on the edges and worn over a purple, high-collared, sleeveless uniform. He wore a purple forehead protector and a pair of simple wrist-guards. The kanji for 'gold' (金, kin) was tattooed upon the shoulder of his exposed left arm."}
{"character_name":"Kurotsuchi", "character_pic":"https://static.wikia.nocookie.net/naruto/images/2/29/Kurotsuchi_Part_II.png","description": "Kurotsuchi (黒ツチ) is a kunoichi of Iwagakure, the granddaughter of the Third Tsuchikage, and the great-great granddaughter of the First Tsuchikage via her grandfather, Ōnoki. After the retirement of her grandfather, the Third Tsuchikage, she would later follow their endowment by taking on the mantle as the Fourth Tsuchikage (四代目土影, Yondaime Tsuchikage, literally meaning: Fourth Earth Shadow).","affiliation":"Iwagakure,Allied Shinobi Forces","background": "In the anime, after becoming a ninja, a young Kurotsuchi witnessed Deidara flee from Iwagakure, shortly after bombing surrounding buildings. At the time, Deidara had already become a part of the Akatsuki.","ability": "Kurotsuchi is a highly capable kunoichi, having been chosen to guard the Third Tsuchikage during the Kage Summit, and provide backup for Genbu. From her participation in the Fourth Shinobi World War, a legend arose that she didn't flinch when facing a hundred thousand Zetsu.Her skills ultimately earned her enough recognition to become the Fourth Tsuchikage years later.","appearance": "Kurotsuchi has short, black hair and distinctly pink eyes(depicted as black in the anime and Boruto series) which are accentuated by her eyelashes running upwards at the corners. She wears the standard attire of the Iwa-nin consisting of a red uniform with her right sleeve missing and a lapel over her right leg, the brown Iwagakure flak jacket, fishnet tights and a skirt over them. She also wears regular shinobi sandals and a pair of gloves.Years later, she abandons her forehead protector and dons a red dress that is kept open on the front-right side from the waist down, revealing her right leg. It only has a sleeve on the left side. She also started wearing her hair shorter around the sides as well as red nail polish."}
{"character_name":"Log", "character_pic":"https://static.wikia.nocookie.net/naruto/images/9/94/Log_Infobox.png","description": "Log (ログ, Rogu) is a synthetic human created by Orochimaru and the older clone brother of Mitsuki.","affiliation":"Otogakure","background": "Log was created as a synthetic human by Orochimaru, being cultivated from an embryo and given the name Mitsuki (ミツキ), after 'Tsuki' (杯, literally meaning: Vessel) and the sixth sign of the Chinese zodiac calendar, 'Mi' (巳, literally meaning: Snake). However, he rebelled against Orochimaru, escaped and, now calling himself Log, started down the path of destroying the original embryo from which he originated, deeming Orochimaru's experiments to create life unethical. This background story was soon revealed to be a ruse set up by Log and Orochimaru in order to force the young Mitsuki to make a decision: either join him in destroying Orochimaru and eventually themselves, remain with Orochimaru and follow his orders, or choose his own path in life.","ability": "Log appears to be quite skilled as he was able to temporarily fend off and counter his parent's — who himself is a renowned shinobi — attacks for a short while. He also makes use of a sword in combat, showing considerable speed and likewise skill in kenjutsu against his parent. With his Armour-Eater technique, he is able to manipulate his armour into various shapes to aid him in battle, such as encasing and restraining his opponent.","appearance": "Log is a tall individual with dull-blue, shoulder-length hair, and golden eyes. Overall, he bears an exact resemblance to his clone sibling Mitsuki with the exception of adult facial features befitting his older age and a scar across his right cheek. When first seen, he wore a dark-coloured haori, which concealed his entire appearance. When confronting Orochimaru and Mitsuki, he wore what appeared to be a modernised form of a shinobi battle armour complete with large arm-guards, outer thigh-guards and a hybrid breastplate. He also wore a kabuki mask, which had slits for eye-holes, a protuberant nose and a frowning mouth. He takes to using an ornate snake-themed lighter, and carries a sword strapped vertically to his back. In the anime, Log wears a long hooded dark grey cloak."}
{"character_name":"Lars Alexandersson", "character_pic":"https://static.wikia.nocookie.net/naruto/images/1/18/UNS2_Lars_full.png","description": "Lars Alexandersson (ラース・アレクサンダーソン, Rāsu Arekusandāson) is a bonus playable guest character in Naruto Shippūden: Ultimate Ninja Storm 2. Lars is part of a crossover with the Tekken franchise and was originally introduced in Tekken 6, where he received an extra costume design created by Masashi Kishimoto; this design formed the basis of his appearance in Ultimate Ninja Storm 2.","affiliation":"","background": "In Tekken 6, Lars is a half-Swedish, half-Japanese soldier within the Tekken Force, and is the illegitimate son of Heihachi Mishima, half-uncle of Jin Kazama, half-brother to Kazuya Mishima, and adoptive brother of Lee Chaolan. He travels the world for a time, then leads the Tekken Force in a rebellion against the Mishima Zaibatsu and the G-Corporation, military forces controlled by his half-nephew, Jin Kazama and half-brother, Kazuya Mishima.","ability": "In Tekken 6, Lars uses the fictional Tekken Force fighting style and has many attacks named after military terminology, weapons, and technology. He can perform Dynamic Entry (a stance where Lars dashes forward, unlike Might Guy's Dynamic Entry), as well as a technique known as Silent Entry (a stance where Lars dashes forward while in a crouching position). Compared to several other Tekken characters, Lars' style involves heavier acrobatics and some various chopping attacks akin to karate.In Naruto Shippūden: Ultimate Ninja Storm 2, Lars is shown to be his exceedingly skilled in taijutsu and, as such, is his main arsenal. He mainly combined his attacks with Lightning Release, by flowing chakra through his body at the point of contact (when in reality, the lightning is mainly the qi/ki/chi that anyone of the Mishima Bloodline takes the form of as Lars himself is later revealed to be a half-Mishima). In addition, he is capable of using a minigun designed with motifs similar to his outfit; however, in keeping with the series' trend of not using any true firearms, the minigun fires kunai instead of bullets at a pretty impressive rate.","appearance": "Lars is a man with green eyes and blond hair that features fringe bangs with upturned spikes in the back and a topknot in the shape of a crescent moon. He wears a patterned red kimono, decorative white obi, and golden armour adorned with a lion, spiral designs, and clawed gauntlets. His outfit includes golden accessories, including a hair pin, rings fastened to the collar of his kimono, and an accessory on the knot of his obi. The back of his kimono features a stylised '46' design as his clan symbol."}
{"character_name":"Magire Kakuremino", "character_pic":"https://static.wikia.nocookie.net/naruto/images/2/21/Magire.png","description": "Magire Kakuremino (隠蓑マギレ, Kakuremino Magire) is a citizen of Konohagakure.","affiliation":"Konohagakure","background": "Magire attended the Academy in a different class from Sumire Kakei. Shy by nature and always going unnoticed, Magire was very alone. Eventually, he was noticed by Sumire, who was nice and talked to him. This eventually made Magire develop a crush on her.","ability": "Fitting his shy nature, Magire's specialty in combat is concealment. He is shown to be very stealthy, able to move about with even an experienced shinobi like Shino Aburame not noticing him. He also excels in the Cloak of Invisibility Technique, enabling him to hide from full view of others. He has considerable skill in shurikenjutsu, showing sleight-of-hand with them and able to launch multiple kunai with great accuracy and quick succession, which combined with his concealing skills allow him to keep his enemies off guard.","appearance": "Despite his shyness, he is apparently considered rather handsome, as noted by Chōchō Akimichi. Magire is a fairly tall boy for his age. He is pale-skinned with straight long brown hair that parts down the centre of his forehead and reaches his upper back. He wears grey pants and a white long-sleeved shirt with a white mantle over it reaching his waist."}
{"character_name":"Mahiru", "character_pic":"https://static.wikia.nocookie.net/naruto/images/a/a3/Mahiru_Infobox.png","description": "Mahiru (マヒル) was a jōnin from Iwagakure.","affiliation":"Iwagakure","background": "During the Third Shinobi World War Mahiru was partnered with Kakkō and Taiseki. He went out to surveillance the area in which Team Minato was travelling. He employed about twenty shadow clones against the team, only to have all of them destroyed by Kakashi's Chidori. However, in the end he was able to counter the Chidori and would have succeeded in killing Kakashi without the intervention of Minato Namikaze who quickly got Kakashi to safety before holding a kunai to Mahiru's neck. Mahiru was then killed, but not before expressing regret for not running away when given the chance.","ability": "At his best working alone, Mahiru employs the use of kenjutsu in combat, being able to overpower the child prodigy, Kakashi, with his extreme speed and sword. Aside from kenjutsu, Mahiru makes use of high-level ninjutsu like the Shadow Clone Technique, capable of employing up to twenty clones at once. He was also skilled with Earth Release techniques using it to ambush opponents.","appearance": "Mahiru's hairstyle consists of two spiked ponytails, one sticking upwards from the top of his head, the other downwards from the back. He wore the standard Iwa shinobi uniform, complete with a flak jacket and a shirt having no right sleeve along with a dark indument hanging from his waist onto his right leg, reaching to his knees. He wore a simple forehead protector with a blue coloured cloth."}
{"character_name":"Malice", "character_pic":"https://static.wikia.nocookie.net/naruto/images/a/aa/Malice.jpg","description": "Malice (マリス, Marisu) was a kunoichi and the main antagonist that appeared in Naruto Shippūden 3D: The New Era.","affiliation":"","background": "Malice was the most skilled kunoichi of the Rinha clan when her clan was around. During the years of the shinobi wars, shinobi from other countries began targeting her clan for their medical ninjutsu. Her husband got involved and ended up getting killed in battle. After the last war ended, a deadly plague began spreading and her son, Yūto, was taken by the Five Kage to produce an anti-body to eliminate the plague. They succeeded, but at the cost of Yūto's life. She became the village head of a small village until she disappeared.","ability": "Malice had proven to be a very cunning and capable kunoichi. She was very alert, studying her opponent's personalities and abilities in order to easily break them down, thus proving both intelligent and tactically skilled.","appearance": ""}
{"character_name":"Mebuki Haruno", "character_pic":"https://static.wikia.nocookie.net/naruto/images/0/0a/Mebuki_Haruno.png","description": "Mebuki Haruno (春野メブキ, Haruno Mebuki) is a kunoichi from Konohagakure. She is also a member of the Allied Mothers Force.","affiliation":"Konohagakure","background": "In the anime, after learning that her daughter was to be taught by Kakashi Hatake, Mebuki and her husband were visited by Kakashi and the Third Hokage, inviting them for tea.","ability": "In the anime, it is shown that Mebuki is adept at using taijutsu, as seen when she was able to defeat a sumo wrestler with a single kick. She can also fight using unorthodox weapons such as a frying pan.","appearance": "Mebuki is a fair-skinned woman with shoulder-length, blonde hair with a single bang which falls down into her face. She also has green eyes and wears a white qipao dress with three red circular designs at the bottom of the front of her dress as well as the back. Underneath the dress, she wears pink ¾-length pants along with brown sandals. In the anime, when Sakura was a child, Mebuki wore a red qipao dress similar to what her daughter would wear as a genin.Mebuki's alternate-world self was seen wearing the standard Konoha-nin attire complete with a flak jacket. She did not, however, wear the village's forehead protector."}
{"character_name":"Mei Terumī", "character_pic":"https://static.wikia.nocookie.net/naruto/images/6/6f/Mei.png","description": "Mei Terumī (照美メイ, Terumī Mei) is the Fifth Mizukage (五代目水影, Godaime Mizukage, literally meaning: Fifth Water Shadow) of Kirigakure. After the dreadful reign of Yagura Karatachi ended, she became Mizukage and worked tirelessly to reform internal policies and recreate diplomatic relations with other villages.","affiliation":"Kirigakure,Allied Shinobi Forces","background": "As a young girl around the age of nine, Mei had to endure Kirigakure's brutal academy graduation ritual.Living through the dark days of the Village of the Bloody Mist, she had fought drenched in the blood of others and her own for the sake of the village.After taking office as Mizukage, Mei came across challenges while struggling to undo the negative inheritance left by the Fourth Mizukage and the village's own history.In the anime, during the aftermath of Yagura's passing, Mei received a letter from the Fifth Kazekage and Hokage, asking if Kirigakure would participate in the upcoming Chūnin Exams that their villages were hosting. After listening to her aids, Mei informed the Hokage that her village wouldn't be joining.","ability": "Mei is a powerful kunoichi whose abilities earned her the title of Fifth Mizukage.She is calm, observant and perceptive and can pick up on slight discrepancies in another person's personality, as seen when she detected the difference in Ao's behaviour when Fū Yamanaka inhabited his body.Her power was enough to force Sasuke Uchiha into a corner and injure him despite his usage of Susanoo. She has also shown some skill in taijutsu, being able to intercept Black Zetsu from attacking the daimyō with a single kick during the Fourth Shinobi World War.","appearance": "Mei is a tall, slender woman with fair skin. She has green eyes, and ankle-length, auburn hair styled into a herringbone pattern at the back, a top-knot tied with a dark blue band, and with four bangs at the front. Two bangs are short, with one covering her right eye, and two are long, crossing each other on her bust, just below her chin.She wears a long-sleeved, dark blue dress that falls just below the knees. It seems to be closed at the front with a zipper, and is kept open on the front-right side from the waist down. The dress only covers up to the upper part of her arms and the underside of her breasts. Underneath, she wears a mesh armour that covers slightly more of her upper body than her dress. She also wears a skirt in the same colour as her dress and, underneath those, mesh leggings reaching down over her knees. Around her waist, she wears a belt with a pouch attached to the back on the left along with high-heeled sandals, shin-guards reaching up over her knees, dark blue nail polish on her fingers and toes, and is usually shown with purple lipstick (fuchsia in the anime). Years after the Fourth Great Shinobi War, Mei developed minor wrinkles near the corners of her lips. Her hair was also noticeably shorter, only reaching to her lower back."}
{"character_name":"Meizu", "character_pic":"https://static.wikia.nocookie.net/naruto/images/5/59/Meizu.png","description": "Meizu (冥頭) and with his older twin brother Gōzu were chūnin of Kirigakure before defecting and becoming mercenaries alongside Zabuza Momochi.","affiliation":"Kirigakure","background": "He and his brother fled the village with Zabuza when he failed in his attempt to kill the Mizukage, and thereafter began working for him as assassins.","ability": "Gōzu and Meizu are a paragon of coordination attacking. Meizu's large metal gauntlets house a retractable shuriken chain running between the two of them, which they can use to bind an enemy and then slice them to pieces. In the event that the shuriken chain is neutralised, Gōzu also has a release mechanism to free him from Meizu for individual attacks. He uses the sharp, poisoned claws on his gauntlet to shred his foes. Meizu was also skilled in stealth, capable of hiding right outside the gates of Konoha without being noticed.","appearance": "Meizu had shoulder-length, wild dark-brown hair and dark eyes. He wears a rebreather that covers the lower half of his face and a large, clawed, poisonous gauntlet on his left arm which had a chain coming out of it that had the other end attached to his brother's own gauntlet. He wore a camouflage suit with bandages around his waist, dark-coloured, knee-length sandals and several pouches around his waist. His Kirigakure forehead protector had two horns on it."}
{"character_name":"Menma Namikaze", "character_pic":"https://static.wikia.nocookie.net/naruto/images/c/cb/Menma_namikaze.png","description": "Menma Namikaze (波風メンマ, Namikaze Menma) is a descendant of the Uzumaki clan in Tenten's Infinite Tsukuyomi dream.","affiliation":"Konohagakure","background": "Menma's life was greatly different than Naruto Uzumaki's, as Menma didn't lose his parents, and had many friends during his childhood. At some point, Kurama was safely transferred from Kushina Uzumaki onto Menma, letting Menma keep his mother while eventually becoming friends with the tailed beast. After graduating from the Academy, Menma became a member of Team Kakashi alongside Sakura Haruno and Sasuke Uchiha. Eventually, Menma became a chūnin.","ability": "Much like Naruto by the Fourth Shinobi World War, Menma is a very skilled shinobi, showing essentially the same abilities and skillset as Naruto. By himself, Menma could fight on par with Hanzō, who single-handedly fended off the entire Sannin, and the Amegakure leader's two summonings. Menma is also well-respected within the village, as he could personally speak with the higher-ups of the village about Tenten's situation, and helped her being freed from jail.","appearance": "Menma looks virtually identical to Naruto, though his blond hair is longer and more shaggy-looking in style with jaw-length bangs framing either side of his face, similar to his father's. He wears the same attire as Naruto's in Part II, consisting of a black and orange slim outfit, with a long black headband for his forehead protector, and black zori sandals reaching his ankles. In addition, Menma wears black fingerless gloves and instead of the Uzumaki symbol on the back of his jacket, he has a green circle with five smaller red circles in it, one in the centre and four around the ends connected by two crossed lines, with two more lined-up red circles above and below the green circle."}
{"character_name":"Mifune", "character_pic":"https://static.wikia.nocookie.net/naruto/images/e/ee/Mifune.png","description": "Mifune (ミフネ) is a samurai warrior, and the General (大将, Taishō) of the Land of Iron.","affiliation":"Land of Iron,Allied Shinobi Forces","background": "At some point, Mifune and other samurai were pitted against Hanzō. While everyone escaped in fear, Mifune stood proud against him, willing to protect his comrades. During their battle Hanzō's kusarigama broke through Mifune's sword and struck his head, poisoning him. With the battle finished, Hanzō expressed his beliefs to him, and, acknowledging his faith and strength, gave Mifune the antidote for the poison and left.","ability": "As a master samurai, Mifune is undoubtedly powerful in battle. As the general of the samurai, Mifune has command of the rest of them and, by extension, is a highly capable leader. An adept thinker, Mifune has also shown a sharp memory, able to anticipate and properly counter enemy tactics he has not seen in decades as showed against Hanzō. Despite his old age, Mifune has also shown great agility as shown from jumping high into the air to reach Sasuke and moving with incredible speed to attack Hanzō before he could form hand seals. He also seems to have built up a tolerance to Hanzō's poison since the two have clashed in their youth.Even during his youth, Hanzō claimed Mifune was strong enough to force him to keep his mask on on the chance his venom sac was ruptured. In the anime, Mifune proved to be a skilled teacher, having trained personally Tsubaki Kurogane.","appearance": "Mifune has long, grey hair, which almost reaches down to his waist, with bandages wrapped around his head, possibly to cover the wound received by Hanzō in their past battle. He has black eyes with distinct wrinkles underneath them, a grey goatee and moustache. During the Kage Summit and the meetings before the war, he wore a simple purple kimono-like outfit and sandals, but when the Fourth Shinobi World War began, he started wearing samurai armour, much more traditional in appearance when compared to the ones worn by his subordinates: it's composed of a breastplate, with four plates protecting his legs attached to it, identical shoulder pads, and matching arm and leg guards. He also wears a belt, to which is attached a pouch and his sword: Kurosawa in his waist. While in the Land of Iron, Mifune doesn't seemingly carry Kurosawa with him but a regular sword instead. Underneath his armour he wears a simple dark suit along with gloves and sandals. Also, unlike other samurai, he doesn't wear a mask. In his youth, he didn't have the moustache, and his goatee was much shorter. He also wore a light green suit of armour during this time period with a breastplate that covered only the upper right side of his chest and bandages over his forearms."}
{"character_name":"Might Duy", "character_pic":"https://static.wikia.nocookie.net/naruto/images/b/b7/Might_Duy.png","description": "Might Duy (マイト・ダイ, Maito Dai), often referred to as the Eternal Genin (万年下忍, Mannen Genin), was a shinobi of Konohagakure.","affiliation":"Konohagakure","background": "Duy spent his entire career as a genin, causing many to look down upon him and earned him the epithet of the 'Eternal Genin' (万年下忍, Mannen Genin). Despite this, after twenty years of tireless training, Duy perfected how to use all Eight Gates. He later had a son, Guy, who showed little progress as a shinobi himself, failing his first attempt to enter the Academy. When Guy began feeling sorry for himself, Duy scolded him for not having faith, and ultimately taught Guy how to use the Eight Gates. One day, he and Guy met Sakumo Hatake and his son Kakashi in front of the Academy; Sakumo assumed their sons would be classmates, only to learn that Guy flunked the entrance exam.","ability": "In the anime, it was said that Might Duy wasn't able to use both ninjutsu and genjutsu. He also failed simple missions. It was revealed that his poor performance was due to him secretly training to master the Eight Gates every night, which has a common side effect of weakening the user for a prolonged period of time.","appearance": "Duy was a tall and well-built man with high cheek-bones, a somewhat bulbous nose, dark hair, thick eyebrows and noticeable body hair on his wrists and forearms. His hair was cut in a bowl style that was combed to his right and lifts slightly. He also sported a bristling moustache with a small goatee and stubble which made up the rest of his beard. He wore a green jumpsuit, orange striped leg warmers, and a yellow scarf around his neck."}
{"character_name":"Mui", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/4b/Mui_Blood_Prison.png","description": "Mui (無為) was a jōnin from Kusagakure and the master (主, aruji) of Hōzuki Castle. He is the primary antagonist of Naruto the Movie: Blood Prison.","affiliation":"Kusagakure","background": "Mui's wife passed away not long after their son, Muku, was born, so he raised him all by himself. He was a caring father who loved his son deeply, often taking Muku to eat ramen. Ten years ago, as the guardian of the Box of Ultimate Bliss, Mui, tried opening it once with Muku's chakra, in the hopes of asking the box to grant them the wish of reviving Kusagakure to its former glory. However, Muku didn't have enough chakra and was sucked into the box instead, leaving Mui grief-stricken. As a result, he sought a way to reopen the box to ask for his son back, unbeknownst to his superiors.","ability": "Being the warden of the Hōzuki Castle as well as a jōnin, Mui was a highly competent and skilled shinobi.Physical Prowess-Mui had great skill with taijutsu, being able to defeat multiple prisoners barehanded without losing his composure, as well as easily defeating a weakened Naruto with a series of swift punches. Mui also had knowledge of pressure points, knocking Naruto unconscious with a few strikes. He was incredibly resilient, as even after suffering a fatal wound through the chest by his son, Mui managed to get back up on his feet and apply a powerful seal.","appearance": "Mui had long black hair that goes beyond his shoulders, though ten years ago, when he was trying to use Muku to open the Box of Ultimate Bliss, his hair was around shoulder-length. He wore some sort of suit with a brown belt and a silver buckle. He also wore brown boots. When meeting with other members of the Fruit Group, he donned the metal head of a bull and wore loose-fitting, black robes."}
{"character_name":"Murakumo Kurama", "character_pic":"https://static.wikia.nocookie.net/naruto/images/b/be/Murakumo_Kurama.png","description": "Murakumo Kurama (鞍馬ムラクモ, Kurama Murakumo) was a jōnin of Konohagakure and head of the main branch of the Kurama clan.","affiliation":"Konohagakure","background": "Murakumo and his wife Uroko Kurama's daughter and only child, Yakumo, was born with the full scope of the Kurama Clan's Kekkei Genkai, but also with a weak and frail body. As the Kurama clan had produced few ninja where once they were one of the more prominent clans in Konohagakure, Murakumo was eager to remedy this predicament sought to change the clan's fortunes around by ensuring his daughter's development into her full potential as a genjutsu-user. Murakumo approached the Third Hokage and petitioned for a special tutor to oversee her training, hoping that she could overcome her frail condition by focusing purely on her genjutsu.","ability": "He was presumably a very skilled shinobi, able to obtain the ninja rank of a jōnin. Given that he was the leader of the main branch of the Kurama clan, he was most likely a strong genjutsu user.","appearance": "Murakumo had long black hair and a black moustache. He has light-coloured eyes.Abilities"}
{"character_name":"Naruto Uzumaki", "character_pic":"https://static.wikia.nocookie.net/naruto/images/d/d6/Naruto_Part_I.png","description": "Naruto Uzumaki (うずまきナルト, Uzumaki Naruto) is a shinobi of Konohagakure's Uzumaki clan. He became the jinchūriki of the Nine-Tails on the day of his birth — a fate that caused him to be shunned by most of Konoha throughout his childhood. After joining Team Kakashi, Naruto worked hard to gain the village's acknowledgement all the while chasing his dream to become Hokage. In the following years, through many hardships and ordeals, he became a capable ninja, regarded as a hero both by the villagers, and soon after, the rest of the world, becoming known as the Hero of the Hidden Leaf (木ノ葉隠れの英雄, Konohagakure no Eiyū, literally meaning: Hero of the Hidden Tree Leaves). He soon proved to be one of the main factors in winning the Fourth Shinobi World War, leading him to achieve his dream and become the village's Seventh Hokage (七代目火影, Nanadaime Hokage, literally meaning: Seventh Fire Shadow).","affiliation":"Konohagakure,Mount Myōboku,Allied Shinobi Forces","background": "Naruto was born on the night of October 10th to Minato Namikaze (the Fourth Hokage) and Kushina Uzumaki (the second jinchūriki of the Nine-Tails). He was named after Naruto Musasabi, the protagonist of Jiraiya's first book, which made the Sannin his godfather.The Third Hokage made special arrangements for Minato to preserve Kushina's seal containing the Nine-Tails while she gave birth to Naruto in a remote location, assisted by midwives and Anbu. A masked man, Tobi, tracked down their location, however, killed the midwives and Anbu, and captured Naruto, forcing Minato to quickly rescue him and teleport him to a safe house.With Minato gone, Tobi captured Kushina and released the Nine-Tails from her, using it to devastate Konoha.Minato saved Kushina and left Naruto in her care before he went to protect the village, eventually defeating Tobi and freeing the Nine-Tails from Tobi's control. Returning to Naruto and Kushina's location, Minato realised the only way to stop the Nine-Tails was to seal it within Naruto, believing that his son would someday need the fox's power to defeat Tobi when he returned. Since the Nine-Tails' chakra was too immense to be sealed into an infant, Minato sacrificed his soul to split the fox's chakra in half, sealing the Yin half within himself and the Yang half within Naruto. After telling Naruto how much they loved him, Minato and Kushina succumbed to their wounds from protecting their son from the Nine-Tails and passed away.","ability": "Originally, Naruto was a rather inept ninja, failing to graduate from the Academy three times. Through sheer determination and training however, his skills rapidly improved to defeat strong genin like Neji Hyūga, Gaara, and Kabuto Yakushi, earning acknowledgement from all the Sannin for his potential.Under various tutelage, Naruto was able to defeat various members of Akatsuki, ultimately earning praise from Konohagakure as a Hokage-material hero.Naruto's personally defeated various reincarnated Kage and jinchūriki during the Fourth Shinobi World War,with many believing he was the central key to winning the battle.By adulthood, his prowess made him the Seventh Hokage, regarded as the strongest shinobi in history and having command of overwhelming jutsu. With the combined might of Sasuke Uchiha, noted as his only rival in power, they are said to be able to destroy the world.Together, they overpowered Momoshiki Ōtsutsuki who absorbed Kinshiki Ōtsutsuki, and pushed Jigen's body to its limit. Overall, he could compete against if not defeat world-threatening opponents, such as Obito Uchiha, Madara Uchiha, Kaguya Ōtsutsuki, Toneri Ōtsutsuki, and while fighting at his absolute peak managed to overwhelm Isshiki Ōtsutsuki.","appearance": "According to Jiraiya, Naruto strongly resembles his father:he has yellow-blond, spiky hair and blue eyes, while inheriting the shape of his mother's eyes and face.His trademark characteristics are the three whisker markings on his cheeks. During the Fourth Shinobi World War, Dan Katō initially mistook Naruto for Nawaki due to their stark resemblance.Naruto was rather short for his age during Part I,though he grew to be taller than Sakura in Part II.Naruto originally wore green goggles on his forehead, though he discards them upon becoming a genin."}
{"character_name":"Naori Uchiha", "character_pic":"https://static.wikia.nocookie.net/naruto/images/a/a1/Naori_Uchiha_preview.png","description": "Naori Uchiha (うちはナオリ, Uchiha Naori) was a kunoichi from Konohagakure's famed Uchiha clan.","affiliation":"Konohagakure","background": "Her close friend Naka Uchiha was able to use Izanagi and in time, became obsessed with its power. She was determined to save him from it and so ultimately cast Izanami on him in order to get him to see the error of his ways and come to accept fate. She was successful in this and Naka was able to finally accept the truth and break the endless loop the technique had plunged him into.She presumably died either before, or during the Uchiha Clan Downfall along with the rest of her clansmen.","ability": "Naori was undoubtedly a powerful ninja. She was shown wielding a sword, indicating skill with kenjutsu. She was also able to awaken her clan's dōjutsu: the Sharingan and was even able to awaken the Mangekyō Sharingan. Unlike most known Mangekyō form, the colour of her dōjutsu is inverted. It is split down the middle in three and has an appearance similar to a three-petal flower.","appearance": "Naori had long wavy purple hair and cropped bangs hung over her Konohagakure forehead protector with only the Konoha symbol showing on it. She also wore the standard mantle of the Uchiha clan with their crest emblazoned on the back along with two swords strapped to her left hip by multiple bandages."}
{"character_name":"Nue", "character_pic":"https://static.wikia.nocookie.net/naruto/images/1/1c/Nue.png","description": "Nue (鵺) is a yōkai that was created by Root. It is the result of Project Gozu Tennō, designed to be the ultimate weapon harvested from Hashirama Senju's cells. While spearheaded by Tanuki Shigaraki, it was passed on to his daughter Sumire Shigaraki with the intention to wreak havoc in Konohagakure.","affiliation":"Konohagakure","background": "As Danzō continued his amoral methods to protect Konohagakure, upon realising the potential power within the First Hokage's very cells, he harvested some of them. Placing Tanuki Shigaraki, one of his top researchers and most loyal followers on the project, the goal was to create an ultimate weapon. After Danzō's demise, the blindly loyal Tanuki grew to resent Konohagakure for 'betraying' Danzō. Desiring to avenge him, he relentlessly continued his research into finishing the project, all while training his daughter to properly wield the power of the beast in the event he died before its completion. Eventually, he met his own demise after passing the Nue on into Sumire.In the following years as Sumire established a new identity, she began nurturing the creature's development, forming a strong bond with its summoner.","ability": "Nue is able to sense the negative emotions in an individual, using that to select its target.Once it possesses someone, it preys on their emotions, making them give in to their darkest impulse leaving the victims themselves unaware. Only when the victim overcomes their negative emotions or is knocked out will the spectre be forced out from its vessel. It also is able to feed off their victim's chakra as sustenance and strengthen itself.Being produced from the genetic material of Hashirama Senju, Nue is able to produce a diluted Wood Release, able to produce plant life to aid in its acquiring of chakra.","appearance": "Normally, it appears as a shapeless dark purple mass. While absorbing enough chakra, Nue takes a tangible form that is reminiscent of a chimera: it is large and has a monkey's head with large fangs and a white mane, a tanuki's body, a tiger's legs, a white snake for a tail and glowing yellow eyes."}
{"character_name":"Obito Uchiha", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/4a/Obito_Uchiha.png","description": "Obito Uchiha (うちはオビト, Uchiha Obito) was a member of Konohagakure's Uchiha clan. He was believed to have died during the Third Shinobi World War, his only surviving legacy being the Sharingan he gave to his teammate, Kakashi Hatake. In truth, Obito was saved from death and trained by Madara, but the events of the war left Obito disillusioned with reality, and he inherited Madara's plan to create an ideal world. Resurfacing under the names of Tobi (トビ, Tobi) and Madara Uchiha himself, Obito subtly took control of the Akatsuki, using them as a means to advance his machinations, eventually going public and starting the Fourth Shinobi World War. However, towards the war's conclusion, Obito had a change of heart and, as atonement, sacrificed his life to save the same world he sought to replace.","affiliation":"Konohagakure,Akatsuki, Kirigakure","background": "bito grew up not knowing who his parents were; in the anime, he was left in the care of his grandmother. Feeling alone in the world, Obito dreamed of becoming Hokage so that the people of the village would acknowledge his existence.He enrolled in the Academy to help him achieve that goal, where he developed a one-sided rivalry with Kakashi, whose natural talent and popularity he was jealous of. He also became a close friend of Rin Nohara, whom he eventually fell in love with. After finally graduating some years later, Obito, Rin, and Kakashi were placed on a team under the leadership of Minato Namikaze.","ability": "As a genin, Obito's abilities were average at best, struggling to match his classmates from the Academy. Determined to improve himself, he trained for several months at a time to eventually become a chūnin. Madara saw great potential in Obito and thus selected him as his disciple.Madara's hopes were proven correct, as under his tutelage, Obito dramatically improved his abilities as a late bloomer, with his skills leading to others questioning if he was Madara.As a teenager Obito posed a threat to the Five Great Shinobi Countries, having taken control of the Fourth Mizukage and effectively Kirigakure, as well as posing a challenge to the Fourth Hokage and nearly destroying Konoha. The Fourth Hokage after seeing teenager Obito's powers, believed that he would bring catastrophe to the world and only Naruto with the power of Nine-Tails would stop it.Years later even Naruto agrees that Fourth Hokage could not do anything against the power of Obito.As an adult, he defeated Root's most skilled ninja, and simultaneously held his own against Konoha's top shinobi and Killer B. As the Ten-Tails Jinchūriki, Obito's power exceeded that of even Hashirama Senju, he was able to effortlessly fight three powerful Hokage with ease, overwhelm both Naruto and Sasuke several times, and had the capability to destroy the entire Allied Shinobi Forces.","appearance": "As a child, Obito had black eyes and short, spiky, black hair. He wore a long sleeved blue uniform and a blue jacket with an orange collar and trimmings. The jacket was fastened to the rest of the outfit by two buttons on the collar and had the Uchiha clan crest at the back. He also wore a white belt, shinobi sandals, the standard Konoha dark blue forehead protector, and a pair of goggles with orange lenses connected to ear protectors. The right half of his face was left heavily scarred after the events in Kusagakure, resembling wrinkles, while the destroyed right half of his torso and his right arm have been replaced by White Zetsu matter, which have a much lighter colour than his body. His hair grew longer during his rehabilitation, and he would repeatedly grow it out and cut it over the years."}
{"character_name":"Oko", "character_pic":"https://static.wikia.nocookie.net/naruto/images/7/77/Oko.png","description": "Oko (オコ) is a member of the Byakuya Gang.","affiliation":"Land of Snow","background": "After Gekkō brought Ryōgi into their organisation, Oko justified the goods they stole to the child.","ability": "As a member of an internationally-known thieving group, Oko is very stealthy on his missions. He is relatively skilled at taijutsu, being able to fend off Boruto Uzumaki in a short clash. He is also proficient in Fire Release, able to conjure multiple fireballs to launch at his foe.","appearance": "Oko is a fair-skinned man with shoulder-length dark red hair and brown eyes. He wears a Byakuya Gang attire and an owl mask."}
{"character_name":"Osuka Kamakura", "character_pic":"https://static.wikia.nocookie.net/naruto/images/a/a1/Osuka_Kamakura.png","description": "Osuka Kamakura (鎌倉オスカ, Kamakura Osuka) is an Academy student in Konohagakure.","affiliation":"Konohagakure","background": "Osuka's mother Hibari is an old friend of Neon's mother, which led to them being friends. When her parents began spending less time with her due to their careers, Neon was asked to keep her company, as Osuka struggled to make friends. From early childhood, Osuka would occasionally join her parents on their movie shoots. One such occasion was at a mountain range where she learned how to identify edible plants.","ability": "While studying in the Academy, Osuka has gained proficiency in basic skills like the Tree Climbing Practice and Rope Escape Technique. Like her parents, Osuka is a skilled actress, Himawari noting her ability to embrace her character's demeanour. She has noticeable survival skills, having been taught how to find and identify edible plants.","appearance": "Osuka is a fair-skinned girl of average height with brown eyes. Her hair is pink and permed up with strands framing the sides of her face and short bangs. She wears a pink, sleeveless blows with a light pink off-the-shoulder, sleeveless shirt over it."}
{"character_name":"Pakkun", "character_pic":"https://static.wikia.nocookie.net/naruto/images/b/bc/Pakkun.png","description": "Pakkun (パックン) is a miniature pug, and the smallest of Kakashi Hatake's ninken.","affiliation":"Konohagakure","background": "In the anime, some time after Pakkun and the other ninken made a contract with Kakashi, they aided him to search the abducted Rin Nohara by Kirigakure shinobi and acted as a diversion in order to allow them to flee.They also helped searching for the fleeing Orochimaru, allowing Kakashi and the Root Anbu Kinoe pursue him into the residence of the Iburi clan to save the only survivor, Yukimi.","ability": "Pakkun is revealed to not be a battle-type ninken, which Sakura claimed to know by looking at his small appearance.Despite this and his small size, Pakkun has shown to be a very useful summon. He has been repeatedly shown to have an incredibly sharp sense of smell, even by canine standards. He can regularly determine what type of scent he is picking up, how far away it is, and how dangerous the person is. In the anime, he was shown even able to detect a target's scent that has been masked. Also, he has been shown to have tremendous speed from how effectively he can keep up with full-grown human ninja, even challenging others to keep up with him. He also has a great amount of strength as he was able to drag Shikamaru with him when he refused to help find Sasuke. He has also displayed exceptional teamwork with the rest of his pack developing and effectively using several offensive and defensive formations in battle which make use of their manoeuvrability and powerful limbs. He has also displayed the ability to make clones of himself from his hair.","appearance": "Pakkun is a small, pug-like dog with brown fur and a dark brown snout and ears. He has pink-coloured paws and wears the standard outfit of Kakashi's ninken which consists of a blue vest with the heno-heno-moheji seal and a Konoha forehead protector, but his is worn on top of his head in a similar style to Sakura Haruno. He also wears a bandage on his right front leg."}
{"character_name":"Pakura", "character_pic":"https://static.wikia.nocookie.net/naruto/images/7/71/ParukaAnime.png","description": "Pakura (パクラ) was a famed Sunagakure kunoichi during her lifetime.","affiliation":"Sunagakure","background": "Pakura was Maki's teacher and would regularly train with her. During her lifetime, Pakura, who was also known as the Hero of Sunagakure, was considered a part of negotiations with Kirigakure, according to the village higher ups. She took her last breath while cursing her village and shinobi.In the anime, Pakura's background is further explained. Pakura was sent on a mission to stop Iwagakure's plans during their feud with Suna. She successfully accomplished the mission and was hailed as a hero by the village. Some time later, Pakura was sent on another mission to Kirigakure, to act as an ambassador, but she was betrayed and killed by the ambush they set. After her death, Rasa and the seniors pinned the blame on Iwagakure for her death.","ability": "Pakura was a renowned kunoichi whose skills earned her enough fame during her life that Kabuto actively chose to reincarnate her to fight for Akatsuki. In the anime, she was shown to be a highly perceptive fighter, able to see through most deceptions and react quickly. She was also a skilled close-range fighter, able to fight back a kenjutsu specialist like Omoi only armed with a kunai.","appearance": "Pakura was a fairly tall kunoichi. She was fair-skinned with pupiless brown eyes. She had green hair that she tied in a bun on top of her head with a hair needle running through it and one short and long strands of hair with orange tips framing each side of her face. Her typical attire consists of a sleeveless, backless top and short tight pants, with two lapels on the front and the back. She wears an obi around her waist, as well as purple arm-warmers which extend up to her shoulders, and has bandages around her tights and ankles. Like all reincarnated shinobi, the only changes in Pakura's appearance were that of grey eye sclerae."}
{"character_name":"Orochimaru", "character_pic":"https://static.wikia.nocookie.net/naruto/images/1/14/Orochimaru_Infobox.png","description": "Orochimaru (大蛇丸) is one of Konohagakure's legendary Sannin. With a life-ambition to learn all of the world's secrets, Orochimaru seeks immortality so that he might live all of the lives necessary to accomplish his task. After being caught red-handed performing unethical experiments on his fellow citizens for the sake of this immortality, Orochimaru defected from Konoha rather than be persecuted for his ambitions, and for many years sought the village's destruction in order to take revenge and demonstrate what he had learned. After several apparent deaths in the pursuit of his goals, Orochimaru realises his approach is flawed through Kabuto Yakushi, his former associate, and begins monitoring the choices and actions of his former apprentice, Sasuke Uchiha.","affiliation":"Konohagakure, Root,Akatsuki,Otogakure,Ryūchi Cave","background": "Orochimaru was an orphan who became a pupil of Hiruzen Sarutobi alongside Jiraiya and Tsunade. Compared to the more laid back Jiraiya, Orochimaru stood out as a genius — his talents, insight, and determination were considered by Hiruzen to be that of a prodigy seen only once in a generation. According to Tsunade, Orochimaru had a twisted personality even as a child. His sadistic attitude was presumably due to the death of his parents. At some point after losing them, Orochimaru found a white snake near his parents' grave, with Hiruzen's explanation of it representing fortune and rebirth inspiring Orochimaru to study kinjutsu and obtain knowledge of all techniques. Jiraiya theorised that Orochimaru went down this path in an attempt to forget his painful memories.","ability": "Orochimaru is an exceptional shinobi, recognised as one of the strongest to ever exist. One of the only people who could compete against Hanzō in his prime, he became a Sannin. At the same time, amongst his team, Orochimaru stood out the most in sheer aptitude as a natural prodigy and the best of his generation,earning praise from even Hashirama Senju.Easily Kage-calibre, Orochimaru was once a candidate to be Fourth Hokage. His power is feared throughout the world, such that Akatsuki, which he was once a member, saw him as a threat.Following the Konoha invasion, while failing, Orochimaru's actions left the village crippled for years and the Third Hokage dead. Even crippled and gradually weakening, Orochimaru remained extremely formidable, able to compete against either of his fellow Sannin and even toy with a Version 2 jinchūriki respectively. In the anime, he easily overwhelmed an Inner of Kara, despite their monstrous might and Shinobi-Ware modifications.","appearance": "Orochimaru's most conspicuous characteristic is his snake-like appearance: he has very pale skin, golden eyes with slitted pupils, purple markings around his eyes and fang-like teeth. He also has pronounced cheekbones and straight waist-length black hair with some locks covering and framing his face or to his shoulders. The various bodies he takes over have each been modified to resemble his original form, except for the height differences. In Naruto Gaiden, Orochimaru's facial features soften and somewhat androgynous with his eye markings becoming black. He also wears his hair in a ponytail, allowing two locks to frame the sides of his face. In the manga, his skin-tone becomes noticeably fairer in complexion."}
{"character_name":"Rai Uchiha", "character_pic":"https://static.wikia.nocookie.net/naruto/images/5/5a/Rai_Uchiha.png","description": "Rai Uchiha (うちはライ, Uchiha Rai) was a shinobi of the Uchiha clan.","affiliation":"","background": "Born to the Uchiha clan, Rai was able to awaken the Sharingan in his youth, as well as his own Mangekyō Sharingan. During the continuous struggle between shinobi clans, Rai and his clansmen faced an opposing force who quickly wiped out Rai's comrades with a trap. However, Rai nullified the outcome by sacrificing his left eye in order to use Izanagi. With the enemies slaughtered, he boldly declared that the Uchiha clan was invincible due to the powerful dōjutsu. His prowess in using the forbidden technique made him the leader of the small group of his shinobi until he was challenged by Baru Uchiha, who was able to kill Rai by using Izanagi himself.","ability": "Having been in command of a group of his clansmen, it is presumable that Rai had capable leadership skills. He was a capable swordsman, even with one eye blinded. He also showed a noticeable amount of physical strength, being able to shatter the ground with a single strike of his sword. As an Uchiha, Rai was able to use the Sharingan. From it, he could use one of its most forbidden techniques Izanagi. He was so adept in using the powerful technique, he was able to extend its range from his personal space and target other individuals instead, affecting even an entire battlefield. Rai also had access to the Mangekyō Sharingan. Its design was three thin lines inwardly swirling towards the pupil and three thicker swirls in the same manner.","appearance": "Rai was a young man with shoulder-length black hair, and dark coloured eyes. He wore the standard mantle of the Uchiha clan with its symbol emblazoned on the back. He also wore an 'X' shaped harness and belt that held multiple pouches and a large equipment pouch on the back. He also had a sword strapped to his back. His Mangekyō Sharingan was in the shape of a black spiral around his pupil."}
{"character_name":"Raidō Namiashi", "character_pic":"https://static.wikia.nocookie.net/naruto/images/d/d1/Raid%C5%8D_Namiashi_mugshot.png","description": "Raidō Namiashi (並足ライドウ, Namiashi Raidō) is a tokubetsu jōnin of Konohagakure who serves as an elite bodyguard to the Hokage.","affiliation":"Konohagakure and Allied Shinobi Forces","background": "During his entrance ceremony into the Academy, Raidō was present when Obito Uchiha arrived late. In the anime, during the Chūnin Exams, Raidō was placed in a team with Kurenai Yūhi and Asuma Sarutobi. Not much else is known about Raidō's background except for the fact he is regarded highly for his assassination skills. He is also an elite guard to the Hokage. During his time serving under the Fourth Hokage, he was taught the Flying Thunder Formation Technique, the seal for which they have marked on the Fifth Hokage, so that they can travel to her at any time.","ability": "A well noted veteran shinobi who supports the village with his extensive experience and skills, Raidō is known throughout Konoha as a prominent assassin. Given his status as a guard for the Hokage, and the fact that the Sound Four needed to activate the second stage of their cursed seals in order to defeat him and Genma Shiranui when they were both heavily fatigued from a mission, is a testament to the fact that he is a formidable shinobi. Raidō is skilled in kenjutsu, which was displayed when Hidan and Kakuzu attempted to kill Kotetsu and Izumo, Raidō successfully attacked, and fended off Kakuzu with a unique sword called 'Kokutō' — a katana with a darkened, non-reflective surface, which is also coated in poison. Raidō has also shown some aptitude with Space–Time Ninjutsu as he is able to use the Flying Thunder Formation Technique, which was taught to him by the Fourth Hokage due to being part of the Hokage Guard Platoon. Raidō uses this technique in conjunction with his teammates Genma and Iwashi.","appearance": "Raidō's most distinct feature is probably the weal-like scar on his face, running across the bridge of his nose and down across the left side of his face. He has brown spiky hair, dark eyes and wears the standard attire of the Konoha shinobi complete with a forehead protector and the standard flak jacket. He also tends to wear small appendages on his hand ranging from black bandages to metal rings on his fingers. As a child, he wore a red coloured bandage over the bridge of his nose and a red shirt with white trimmings."}
{"character_name":"Raijin", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/48/Raijin.png","description": "Raijin (雷神) is a criminal shinobi who makes up half of the Legendary Stupid Brothers, alongside his older brother Fūjin.","affiliation":"","background": "The two brothers originated from an unknown village. They once killed their comrades over a meal, and calmed down immediately afterwards. After the incident, they were locked up in Konoha Strict Correctional Facility, though the ones who apprehended them struggled with their mighty strength. At some point in their past, they had an encounter with Tsunade and the brothers have been terrified of her ever since.","ability": "Both brothers have monstrous strength and stamina, only increasing to higher levels as they get angrier. Also, with their power, they are able to jump great lengths and run at high speeds. Their strength has been said to be comparable to that of Tsunade's. However this is proven wrong when Tsunade effortlessly defeats them both by merely flicking them both in the head, sending them both flying back several feet. Consequently, the prison they reside in is incapable of containing them, as they can easily break down the cell door. When even Shikamaru, Ino, and Chōji held them in their Shadow Imitation Technique, Mind Body Disturbance Technique, and Partial Multi-Size Techniques, they were able to break out with brute strength alone. However, for all their strength, they are unintelligent and can be easily duped. In addition to their brute strength, both brothers have shown be to impressively resistant to damage. They were able to easily take blows from each other, and Tsunade, without any sustainable injury.","appearance": ""}
{"character_name":"Rasa", "character_pic":"https://static.wikia.nocookie.net/naruto/images/2/24/Yondaime_Kazekage.png","description": "Rasa (羅砂) was the Fourth Kazekage (四代目風影, Yondaime Kazekage, literally meaning: Fourth Wind Shadow) of Sunagakure. Renowned for his ability to use Gold Dust, Rasa's reign as Kazekage was marked by his frequent quelling of rampages by the One-Tailed Shukaku, which he had sealed into his youngest son, Gaara.","affiliation":"Sunagakure","background": "ecause the Land of Wind's daimyō began to cut down on Sunagakure's budget and instead used Konohagakure's less expensive services, Rasa therefore saw his own village in danger of extinction. In order to prevent that, he decided to focus on increasing the quality of the ninja in the village. As such, he ordered Chiyo to seal Shukaku within his youngest son, Gaara, so that he could become Suna's ultimate weapon. As a result, his wife, Karura died from childbirth while Gaara was born prematurely, despite Rasa's desperation to save her life. He then taught Gaara ninjutsu, but assigned Yashamaru to be Gaara's caretaker, ostracising him from his elder siblings Temari and Kankurō. ","ability": "However, as Gaara grew and his abilities began to manifest, Rasa realised that this had been a poor choice, and started to view Gaara as a failed experiment that threatened the inhabitants of Suna, due to Gaara's unstable nature of attacking citizens unintentionally. Being pressured by the village's dying resources and with the council declaring that Gaara was useless to them, Rasa formulated a plan with Yashamaru to test out Gaara's control over Shukaku. Upon this Yashamaru died and Gaara lost control, allowing Shukaku to go wild. Rasa used his Gold Dust to stop the beast. After this incident Rasa saw Gaara was indeed a failure and began issuing orders for Gaara's assassination, but all six attempts ended unsuccessfully. However, later when Gaara began to have more control over his powers due to his new ideals of being alone, Rasa saw this as an opportunity to give his son one more chance, and to appreciate Gaara's usefulness, therefore stopped issuing attempts on his son's life, in hopes of him becoming a powerful tool. In the anime, it was noted that Rasa also sent Pakura to her death as part of an unfair peace treaty between them and Kirigakure where her life was to be forfeited. She was sent to Kirigakure under the pretence of being an envoy, where she was killed. The blame for this was cast on Iwagakure whom his village had a feud with at the time as a means to stir their shinobi to war. Also, during the Third Shinobi World War, as Konohagakure wished to form a peace treaty with the Iwa, they deliberately had the meeting on the Suna borderline, prompting Rasa and his forces to oversee the events should a battle occur. He stated he would deal with any incidents that were to happen, and with that, the Iwa group retreats. Also, in the anime, it was said that Rasa established a rule for the Sunagakure Academy that forbade children who didn't possess skill in ninjutsu or genjutsu to attend. Rasa once mentored Shigezane in Water Release techniques, in order for him to gather gold dust for the Kazekage.","appearance": "Rasa had auburn hair, dark eyes and was usually depicted with a very stern look on his face. He wore a simple black jacket and pants with mesh armour underneath. He carried a small canister strapped to his hip. As he got older, he gained two creases around his mouth. When using his Gold Dust, dark markings appeared around his eyes that bore strong resemblance to Gaara's own dark markings. During his time as the Kazekage, he wore the standard attire of the Kazekage which consisted of a loose fitting green kimono with a white collar and the signature hat with the kanji for wind (風) on it."}
{"character_name":"Ranmaru", "character_pic":"https://static.wikia.nocookie.net/naruto/images/f/f5/Ranmaru7.png","description": "Ranmaru (蘭丸) is a young orphan from Kirigakure, and later an apprentice chef at the Curry of Life Shop.","affiliation":"Kirigakure and Land of Rivers","background": "Ranmaru grew up with a weak body, but the farmers living near him gave him food to survive. One day, he used his kekkei genkai, and accidentally revealed witnessing an injury that he otherwise could not have seen. The villagers realised that he was abnormal and stopped feeding him. Ranmaru became very lonely after a while. Not long afterward, Raiga arrived in the course of a mission, and was planning on killing Ranmaru, but Ranmaru revealed his ability and his perception of the sorrow within Raiga. Raiga then carried him on his back, allowing Ranmaru to see the outside world. During this time, Ranmaru began working in unison with Raiga, using his eyes' various powers to contribute to Raiga's fighting prowess, meeting the Seven Ninja Swordsmen of the Mist in the process (despite the famous group not even being aware of his existence under Raiga's cloak). After Raiga's defection, he and Raiga enslaved a town and forced its villagers to work in its mines, also assembling some followers (including Karashi) to form the Kurosuki family.","ability": "By his own admission, Ranmaru believes his dōjutsu to be superior to the Byakugan. Among a number of vaguely defined abilities, the dōjutsu gives him extrasensory perception allowing him to remotely see and hear events from vast distances. Boasting remarkable analytical prowess, it can be used to can even read someone's innermost thoughts or predict a series of attacks. While he can see chakra, he can also see the physical life force inside a human's body to accurately determine their status being alive or dead. With it, he can cast powerful genjutsu that, even when being aware of its influence, could not be resisted. When competing with other dōjutsu, such as the Byakugan, he can manifest a red dust that hinders their ability to view chakra and overcome genjutsu. Uniquely, he can revitalise another individual's life force — bringing back to life someone who is mostly dead — by transferring some of his own.","appearance": "Ranmaru is a young boy with chin length purple hair which is parted in the middle. He also has red-coloured eyes that would glow whenever he used his dōjutsu. He wore a light-purple shirt with black stripes on each side, a sash around his waist, a pair of dark-coloured pants and sandals. He also has a slightly feminine appearance."}
{"character_name":"Rock Lee", "character_pic":"https://static.wikia.nocookie.net/naruto/images/9/97/Rock_Lee_Part_I.png","description": "Rock Lee (ロック・リー, Rokku Rī) is a shinobi of Konohagakure's Lee clan and a member of Team Guy. Unlike most shinobi, he lacked the skills necessary to use ninjutsu or genjutsu. However, he overcomes those shortcomings by undergoing special training from Might Guy that would make him a taijutsu master while still a genin.","affiliation":"Konohagakure","background": "During his time in the Academy, Lee proved to have no talent for ninjutsu and genjutsu. When he was mocked by his peers because of this, Lee persevered, focusing on taijutsu. After he succeeded in graduating he was added to Team Guy along with Neji Hyūga and Tenten. During the team's first meeting, Lee vowed to become a powerful ninja without using ninjutsu or genjutsu. Neji laughed at him, but their sensei, Might Guy, took a special interest in Lee. He encouraged Lee to keep at it and, in time, began teaching him powerful forms of taijutsu.","ability": "While in the Academy, Lee was looked down upon for his inability to use either ninjutsu or genjutsu. However, with the guidance and support of Might Guy, Lee conditioned himself into a superb ninja who relies exclusively on taijutsu. While originally very limited in even that skill, Lee proved to be a late bloomer by Part I: His greatly improved skill was evident when he defeated Sasuke Uchiha (a natural prodigy), posed a challenge against Gaara in the Chūnin Exams, and held his own against Kimimaro. As a chūnin, he was capable of defeating the legendary taijutsu master Chen, as well as destroy a meteorite by himself. By adulthood, he had advanced to the rank of jōnin. Through Guy's teachings, Lee learned to open five of the Eight Gates at age 12, the sixth gate at age 17, and (in the anime) the seventh gate some time after the Fourth Shinobi World War. By adulthood, Lee mastered the final gate.","appearance": "Lee has shiny black hair, round eyes with prominent lower eyelashes, and very thick eyebrows; as a result, Naruto calls him 'Centipede Brows' As a child, his hair was quite long and fastened in a braid, though he cuts it short by the time he joins Team Guy, letting it curve out and upward. Lee originally wore a white, short-sleeved kimono-shirt with a martial arts belt and dark pants, giving him a more traditional Chinese appearance. He also sported a forehead protector and shinobi sandals."}
{"character_name":"Rōshi", "character_pic":"https://static.wikia.nocookie.net/naruto/images/c/c9/Roshi.png","description": "Rōshi (老紫) was a shinobi of Iwagakure and the jinchūriki of the Four-Tails, Son Gokū.","affiliation":"Iwagakure","background": "Rōshi became the jinchūriki of Son Gokū over forty years before the Fourth Shinobi World War at a young age. During the Third Shinobi World War, Rōshi was paired with fellow Iwa jinchūriki, Han, and confronted Team 6. As the two jinchūriki fired their Tailed Beast Balls, Minato Namikaze teleported his team to safety. Rōshi eventually left his home town of Iwagakure at some point to better understand and control the power of the beast within him.","ability": "Rōshi had been noted to be a powerful shinobi, forcing Kisame Hoshigaki not to play around with capturing him as he was a tough opponent, and leaving Samehada with bad vibes from their encounter. He was also seen using a curved kunai with which it can be assumed that he had proficiency wielding. After his reincarnation and serving as one of Tobi's Six Paths of Pain, Rōshi was equipped with both the Sharingan and Rinnegan. Combining the perceptual and predictive abilities of the former with the shared field of vision ability of the latter, allowed Rōshi to use his attacks in a more precise and coordinated fashion as well as react to enemy attacks more efficiently, both individually and in conjunction and with the other jinchūriki.","appearance": "Rōshi had red hair, moustache and beard which tapered off to a point. He was shown wearing a large headpiece consisting of a three pointed crown-like ridge, bearing both his Iwagakure forehead protector, a ring, and a prominent black piece of armour running across his cheeks and the bridge of his nose. He wore a long-sleeved magenta kimono shirt and pants, with mesh-armour shirt and fitted black suit underneath, along with calf-length sandals."}
{"character_name":"Sai", "character_pic":"https://static.wikia.nocookie.net/naruto/images/0/07/Sai_Infobox.png","description": "Sai Yamanaka (山中サイ, Yamanaka Sai) is the Anbu Chief of Konohagakure's Yamanaka clan. Prior to this, he was a Root member. As per standard Root training, Sai was conditioned to remove all emotions and as such, had difficulty connecting with others. When he is added to Team Kakashi as a replacement for the rogue Sasuke Uchiha, Sai begins to learn more about people's feelings and tries to develop his personality and identity by forming genuine bonds and rediscovering the emotions he was taught to suppress.","affiliation":"Konohagakure","background": "Sai was orphaned as a child and recruited into Root, a secret branch of the Anbu under the leadership of Danzō Shimura. There, he was raised and conditioned to have no personality, personal connections, or a name; 'Sai' being given to him for the purposes of joining Team Kakashi. Though largely successful in this regard, Sai retained an interest in art. When Shin, an older Root member, discovered Sai's drawing ability, he encouraged Sai's talent and they became very close. Over time, Sai came to think of Shin as an older brother and looked up to him. Unfortunately, the final step in Root training called for the two to fight to the death to eradicate all remaining emotions. Before that happened, however, Shin died of an unnamed illness and Sai's Root training suppressed most of the memories he had of him. In the anime, Sai and Shin were forced to fight by Danzō but Shin, knowing that he was dying anyway, told Sai to report to Danzō that he had killed him in battle. Before dying, Shin told his brother that he had to suppress his feelings, and to live for the both of them. Before Shin's death, Sai created a picture book that would depict all the opponents they faced and illustrate the feelings that they shared for each other. Sai organised the book so that his and Shin's portraits would be located at opposite ends of the book, and in the centre pages would be a picture of them holding hands. Some time after the loss of Shin, Sai forgot that this was his intention, and the picture book was left unfinished, though he could never bring it upon himself to discard the book. During his time in Root, Sai was ordered to eliminate a large number of individuals that posed a threat against Konoha. At the time he was assigned to Team Kakashi, the last assassination he performed was of Unmo Samidare.  In the anime, an attempt to gain a powerful fūinjutsu after seeing the Third Hokage sacrifice his life in an attempt to defeat Orochimaru, led Danzō to supervise Sai while he learned how to use the Sealing Technique: Tiger Vision Staring Bullet, noting that it would be dangerous as he would have to use 'emotional energy' in order to make the technique stronger. Sai struggled greatly with this endeavour as it conflicted with his training and, consumed by negative emotions, his training was seemingly left incomplete.","ability": "As a member of Root, Sai is a highly capable shinobi, who is trained in the organisation's kenjutsu. Being said to be strongest Root member of his generation, Danzō had enough faith in Sai's abilities to task him with single-handedly killing Sasuke. By adulthood, his talents led him to become one of Konohagakure's top authorities as the head of Anbu and regular reporting directly to the Seventh Hokage and aiding him in various decisions. Sai is able to use Earth Release to conceal himself underground without disrupting the surface of the earth. He can also use Fire, Water and Yang Release. In adulthood, since marrying into the Yamanaka clan, Sai appears to have become well-versed (or at least knowledgeable) in their hidden techniques to aid his son's training in them. In the anime, he can also use shadow clones. Sai is able to combine ink with the Body Flicker Technique to create a more effective cover up. However, Sai's most notable talent is his skill as an artist, able to create drawings in mere moments. He uses these artistic skills as a source for his Super Beast Imitating Drawing. Using his custom scroll (which contains a compartment for Sai's ink brush and a supply of ink), and applying chakra into the drawings, his creations come to life.","appearance": "Sai has short, straight black hair, and dark eyes which contrast with his translucent-looking pale skin. He is usually seen carrying a small backpack with his brush, scrolls, and ninja ink in it. He wears a short black-and-grey jacket with red straps — as customary of all Root members, to most likely show his allegiance to the organisation. He also carries a tip-less tantō on his back. The rest of his outfit consisted of a high-collared midriff shirt, black pants, shinobi sandals and gloves with his index and thumb fingers exposed, most likely to facilitate the use of his drawing based techniques. When first seen with Team Kakashi, his jacket has a long right and short left sleeves. He had Danzō's cursed seal on the back of his tongue until Danzō's death, which caused it to disappear. Despite his different hair-style and skin-tone, he is noted by many to physically resemble Sasuke. When he's not on missions, Sai wears a casual outfit consisting of a long-sleeve shirt with a high collar, matching pants, and his regular shinobi sandals. This outfit was first depicted as being purple in colour and later, navy blue. He doesn't wear his forehead protector or gloves with this outfit. In the anime, when Sai uses the Sealing Technique: Tiger Vision Staring Bullet and his negative emotions surface because of his use of 'emotional energy', his eyes turn a translucent red colour and his sclerae turn black. This is apparently, as when Danzō countered the symptoms, ink splattered from Sai's body. Two years after the Fourth Shinobi World War, Sai grew his hair longer with his bangs framing his face. His attire is similar to his old Root outfit but his jacket is now completely black with both sleeves of his shirt long, and less of his midriff exposed. He also has a large scroll strapped horizontally to his back and his shinobi sandals reach above his calves."}
{"character_name":"Saiken", "character_pic":"https://static.wikia.nocookie.net/naruto/images/5/58/Saiken.png","description": "Saiken (犀犬), more commonly known as the Six-Tails (六尾, Rokubi), is one of the nine tailed beasts. It was last sealed within Utakata of Kirigakure.","affiliation":"Kirigakure","background": "Saiken and the tailed beasts first came into being in the waning days of Hagoromo Ōtsutsuki, who used his Creation of All Things Technique to divide the Ten-Tails' chakra into nine separate bodies and giving each a name. Some time after being created, the Sage explained to the young tailed beasts that a link existed between them despite their separation. He also foretold of a day when they would be brought together again - though not as they were - and that at that time someone would emerge to show them what true power is. In the anime, before his death, Hagoromo sent Saiken to live in a temple built for the purpose of protecting it in a humid cavernous region. During the First Shinobi World War, Hashirama Senju captured eight of the tailed beasts and sold Saiken and Isobu to Kirigakure at the Five Kage Summit, as a sign of friendship and to ensure a balance of power amongst their new villages. The tailed beast would end up being sealed within Utakata decades later. In the anime, Harusame tried and failed to remove Saiken from within his student, intending to save his Utakata from being a living weapon for their village. Utakata, however, having not heard what his master had said to him, later came under the assumption after the incident that his master had tried to kill him. This failed removal resulted in Utakata transforming into Saiken and killing Harusame.","ability": "As a tailed beast, Saiken has a massive amount of chakra that it can freely share with others and can create a Tailed Beast Ball. Saiken has shown the ability to emit corrosive substances that can instantly disintegrate its target on contact in the form of liquid or gas. Saiken is seen having a great deal of tremendous durability, able to withstand being thrown a great distance by Kurama. Saiken possesses an affinity for Water Release. It can expel a sticky, adhesive substance from its mouth, which is capable of trapping its targets. In the anime, it can use Soap Bubble Ninjutsu.","appearance": "Saiken is an enormous white — with a light blueish tint — bipedal slug with stubby arms, feet and six long tails. It has two prominent optical tentacles (eyes) and hole-like openings as a mouth. Its entire body is covered in a thick, slimy substance. When seen during the last days of the Sage of Six Paths' life, Saiken was much smaller than its present-day self, but was still much larger than the Sage."}
{"character_name":"Sakon and Ukon", "character_pic":"https://static.wikia.nocookie.net/naruto/images/6/6c/Full_Sakon.png","description": "Sakon (左近, Sakon) and his older brother Ukon (右近, Ukon) were twin brothers from Otogakure and the apparent leader(s) of the Sound Four.","affiliation":"Otogakure","background": "In the anime, the Sound Four were originally prisoners of Orochimaru, forced to fight other prisoners to the death in battle royales. By surviving their respective matches, they proved themselves to be the strongest of Orochimaru's prisoners and as such were made his bodyguards. The Sound Four were at some point forced to accept Kimimaro as their leader, who easily defeated them all in battle and, because of his Shikotsumyaku abilities, was slated to be Orochimaru's next host body. Under Kimimaro their group was known as the Sound Five. In the anime, the Sound Five assisted Orochimaru with assassinating the Fourth Kazekage and killing Shiore's team during the Chūnin Exams in Konohagakure. Kimimaro fell terminally ill after this, forcing him to withdraw from the group; he became ill at some unspecified time in the manga.","ability": "Viewing himself as the strongest of the Sound Four, Sakon was regarded as the most dangerous of the four, as well as the fastest by Orochimaru. Sakon tended to prove this point by unnecessarily using extremely powerful moves to show off. In the anime, their strength was valued enough to be reincarnated by Kabuto Yakushi. Furthermore, Shikamaru stated that the duo's prowess was of jōnin-level. Sakon and Ukon were skilled in taijutsu and possessed quick reflexes, particularly Sakon since he was more physically active than Ukon. Sakon was strong enough to dangle Sasuke upside down by his ankle with just one hand and was quick enough to dodge Kiba Inuzuka's Passing Fang at near pointblank range. As the twins would keep their kekkei genkai as secret as long as possible, Ukon would take advantage of their opponents' focus on Sakon and perform sneak attacks. Ukon was very stealthy, leaving Sakon's body without anybody noticing and twice caught Kiba by surprise, quickly making contact with and merging bodies with him, as well as taking his jacket in order to hide his scent.","appearance": "Both Sakon and Ukon had fair-skin and straight, dark blue hair (in the anime, it has a more of a light blue-grey colour) with long bangs that covered each different eye, their bangs were on opposite sides (Ukon's being on the left, Sakon's on the right). They both wore a green shade of lipstick, and had dark markings around their eyes, giving them an androgynous appearance. In most appearances, Sakon is usually shown with a smirk on his face and his head slightly tilted down. As Ukon usually slept inside Sakon's body, his head would protruded the back of Sakon's upper back and hanged limply, making his hair cover his face. Both of the twins have a cursed seal planted on their foreheads just above their eye, which are covered by their bangs. The twins' attire was a black shirt under brown tunics with long sleeves and bore the symbol of the Sound Four on the hem, and black skin-tight shorts. They wore black arm-warmers (which are mistaken for being part of their sleeves), traditional black shinobi sandals with calf-length leg warmers covered by bandages, and a purple, rope-like belt tied in an inverted bow around their waists. To help distinguish between the two, Sakon wore a dark-red beaded necklace around his neck and carried a giant scroll behind his back through one of the loop of his rope-like belt, while Ukon lacks any embellishments in his uniform and had a somewhat deeper voice than his brother. After being reincarnated, Sakon and Ukon looked like they did while alive with the exception the grey sclerae common in all the other ninja Kabuto Yakushi brought back."}
{"character_name":"Sakura Haruno", "character_pic":"https://static.wikia.nocookie.net/naruto/images/6/64/Sakura_Part_1.png","description": "Sakura Uchiha (うちはサクラ, Uchiha Sakura, née Haruno (春野)) is a kunoichi of Konohagakure. When assigned to Team 7, Sakura quickly finds herself ill-prepared for the duties of a shinobi. However, after training under the Sannin Tsunade, she overcomes this, and becomes recognised as one of the greatest medical-nin in the world.","affiliation":"Konohagakure","background": "Sakura is the only child of Kizashi and Mebuki Haruno. She had an healthy childhood, raised by her parents without any serious tragedy or complications, unlike her team members. When she entered Konoha's Academy, a few of the girls in her class started picking on her because of her broad forehead. Sakura tried to combat their teasing by hiding her forehead with her bangs, but this caused the girls to bully her even more. Ino Yamanaka, one of her classmates, saw this, and defended Sakura from her bullies and encouraged her to embrace her forehead rather than hide it. Over the following years, Ino's guidance and friendship helped Sakura become comfortable with herself and develop into her own person. Though she felt indebted to Ino for helping her, Sakura began to feel that she was living in Ino's shadow when she, instead, wanted to be Ino's equal. At some point after she entered in the Academy, Sakura met Sasuke Uchiha and she developed a crush on him. When she told her friends, she was surprised to learn how popular Sasuke was with the girls. Sakura heard a rumour of Sasuke being attracted to girls with long hair and she began letting her hair grow to get his attention. A couple of years later, when she learned Ino had a crush on Sasuke, Sakura ended their friendship so that they could compete for Sasuke's love, thus beginning a bitter rivalry between them. After they were placed in their teams, Sakura approached Ino, telling her of her liking towards Sasuke. Ino revealed that she too had feelings towards him. Sakura took it to end their friendship, starting their dislike towards each other in the beginning of the series.","ability": "As a genin, due to her focus on her studies, Sakura lacked any particular combat skill, other than the basic skills she learned in the Academy. This greatly limited her role in missions, to the point where she frequently noted how much she relied on her teammates, Sasuke and Naruto. On one occasion, she is even stated by Shikamaru to be: 'A kunoichi with no particular talent'. Determined to change herself, she undergoes intense training with Tsunade for two-and-a-half years. From her display of skill in the earlier portions of Part II, others have remarked that Sakura would likely surpass Tsunade. Upon completing the Strength of a Hundred Seal during the Fourth Shinobi World War, she's finally caught up to her team-mates at the time. Two years later, she rises to the rank of jōnin, and was capable of single-handily defeating Kido Tsumiki despite the Anbu being empowered by a Tailed Beast Drug. As an adult, Boruto remarked that she was a suitable replacement for Naruto as Hokage.","appearance": "Sakura has fair skin, green eyes, and pink hair. In her youth, she wore her hair as bangs in order to cover her large forehead and fend off her classmates' calling her 'Forehead Girl' (デコリーン, Dekorīn, English TV: Billboard Brow). Ino encouraged her not to do this and wear her hair back instead, so that others could see her face. Later in her Academy career she let her hair get longer because of rumours that Sasuke was attracted to girls with long hair. During Part I, when she realises that long hair is a vulnerability in combat situations, she cuts her hair and keeps it under shoulder-length from that point onward, which she sometimes pins up in a ponytail while working. As Sakura gets older, she is noted to become quite attractive, with Jiraiya likening her looks to Tsunade's own."}
{"character_name":"Sasuke Uchiha", "character_pic":"https://static.wikia.nocookie.net/naruto/images/2/21/Sasuke_Part_1.png","description": "Sasuke Uchiha (うちはサスケ, Uchiha Sasuke) is one of the last surviving members of Konohagakure's Uchiha clan. After his older brother, Itachi, slaughtered their clan, Sasuke made it his mission in life to avenge them by killing Itachi. He is added to Team 7 upon becoming a ninja and, through competition with his rival and best friend, Naruto Uzumaki, Sasuke starts developing his skills, but eventually grows dissatisfied with his progress. He defects from Konoha so that he can acquire the strength needed to exact his revenge and master the Cursed Seal of Heaven. His years of seeking vengeance and his actions that followed become increasingly demanding, irrational and isolates him from others, leading him to be branded as an international criminal. After learning the truth of his brother's sacrifice, later proving instrumental in ending the Fourth Shinobi World War, and being happily redeemed by Naruto, Sasuke decides to return to Konoha and dedicate his life to help protect the village and its inhabitants, becoming referred to as the 'Supporting Kage' (支う影, Sasaukage, literally meaning: Supporting Shadow).","affiliation":"Konohagakure, Otogakure, Ryūchi Cave, and Akatsuki","background": "Sasuke is the second and youngest son of Mikoto and Fugaku Uchiha; they named him after Sasuke Sarutobi in the hopes that he would someday be just as strong of a shinobi. Sasuke grew up in the shadow of his older brother, Itachi, a natural prodigy who many in the Uchiha clan and the village would constantly compare Sasuke and any of his accomplishments to. Sasuke himself adored Itachi, never passing up an opportunity to spend time with him. Although Itachi welcomed his company, letting Sasuke watch him train and taking him on adventures into the forests, Itachi in return rarely helped Sasuke himself become a better shinobi; when asked, he would often instead poke Sasuke's forehead and promise to do so some other time. Sasuke found this annoying, but didn't allow it to blemish his high opinion of his brother. After a long day of training, Sasuke returned home one night to find the streets littered with the bodies of the Uchiha. He rushed home to notify his family of this Uchiha Clan Massacre, only to find Itachi standing over the bodies of their parents. Sasuke tried to solicit help and comfort from Itachi, who responded by using Tsukuyomi on him to torment him with visions of him murdering their family. Horrified by what Itachi had done, Sasuke pleaded for an explanation, to which Itachi replied that it was to test his own power. Fearful that he would be next, Sasuke tried to run. Itachi cornered him and explained that Sasuke, as he then was, would not be worth killing. Only by becoming stronger, such as by acquiring his own Mangekyō Sharingan, could he prove a worthwhile challenge to Itachi's abilities. Before leaving, Itachi encouraged Sasuke to hate him, to desire revenge, and to gain power from that. Sasuke immediately followed through, pursuing Itachi and using his newly-awakened Sharingan to attack him.","ability": "Sasuke is recognised as a natural prodigy of the Uchiha clan, graduating at the top of his class in the Academy. He made a strong impression on Kakashi Hatake in the bell test, and could fight on par with strong shinobi, such as Haku and Gaara in Part I. After Orochimaru's tutelage for three years, Sasuke becomes strong enough to fight and even pressure Itachi, as well as the Fourth Raikage. With the Six Paths Chakra, he is compared to the Sage of Six Paths by Kurama, and was able to help fight Madara who was the Ten-Tails' jinchūriki. Madara admitted he would have chosen Sasuke over Obito as an apprentice if he was born years earlier. As an adult, despite losing his left arm, his performance has shown no impediment, as he fought on par with Kinshiki Ōtsutsuki. Ultimately, he is regarded as a legendary shinobi that like Naruto, is referred to as the strongest shinobi ever, with the Hokage viewing him as his only equal. The pair's combined strength is thought to be able to destroy the world. Likewise, together they could overpower Momoshiki Ōtsutsuki who absorbed Kinshiki Ōtsutsuki, something the other four Kage combined struggled against the former, and even pushed Jigen's body to its limit.","appearance": "According to Hashirama Senju, Sasuke bears a strong resemblance to Izuna Uchiha: he has black eyes and spiky black hair with a blue tint. Sasuke's hair is long and has hung over his face as bangs since he was a child, which as he gets older he allows to grow longer and, in turn, cover more of his face. After acquiring his Rinnegan, Sasuke grew his hair to cover the left side of his face, notably the eye. He is considered very handsome by most girls near his age."}
{"character_name":"Shiba", "character_pic":"https://static.wikia.nocookie.net/naruto/images/9/9d/Shiba.png","description": "Shiba (シバ) is a ninken, and personal summon of Kakashi Hatake.","affiliation":"Konohagakure","background": "In the anime, after they made a contract with Kakashi, Shiba and the other ninken aided him to search the abducted Rin Nohara by the Kirigakure shinobi and acted as a diversion in order to allow them to flee. They also helped searching for the fleeing Orochimaru.","ability": "Shiba possesses heightened senses with which he can use to track his target with ease. He has also demonstrated the ability to track his target underground through the use of the Summoning: Earth Release: Tracking Fang Technique as well as hold a target down, allowing Kakashi to attack them freely. He also has exceptional teamwork with the rest of his pack, able to develop and effectively use several offensive and defensive formations in battle which make use of the manoeuvrability and powerful limbs.","appearance": "He has light grey fur with a white underside and a black crest on his head reminiscent of a mohawk. His eyes are round and have dark markings above them, not unlike those of Kisame Hoshigaki. He also wears the standard outfit of Kakashi's ninken which consists of a blue vest with the heno-heno-moheji seal and a Konoha forehead protector around his neck and bandages on his front legs."}
{"character_name":"Shikaku Nara", "character_pic":"https://static.wikia.nocookie.net/naruto/images/e/e0/Shikaku_Nara.png","description": "Shikaku Nara (奈良シカク, Nara Shikaku) was the Jōnin Commander of Konohagakure, head of the Nara clan and was a member of an Ino–Shika–Chō trio alongside Inoichi Yamanaka and Chōza Akimichi.","affiliation":"Konohagakure","background": "When he became a genin, Shikaku was partnered with Chōza Akimichi and Inoichi Yamanaka.In the anime, nearing the end of the Third Shinobi World War, his team was assigned to deliver a request for a peace treaty between Konoha and Iwagakure. Anticipating the Iwa shinobi to turn hostile, the meeting was strategically held at the borderline of the Land of Wind, knowing that the Fourth Kazekage would oversee the meeting should a battle breakout on his land. During the Nine-Tailed Demon Fox's Attack, Shikaku and his team-mates assisted in the village's defence. He wondered if it was Minato who had deflected the Nine-Tails' Tailed Beast Ball.","ability": "As a jōnin-level shinobi and head of his clan, Shikaku was undoubtedly a very powerful shinobi. According to Kakashi, Shikaku's talents would make him a highly-capable Hokage. His skills and reliability garnered him high respect from other powerful ninja, such as the five Kage, especially A and Ōnoki, the former trusting him enough to lead and command the entire Allied Shinobi Forces in the Kages' stead while they went away to deal with emergency situations. Like other Nara, he had mastered many of his clans secret techniques which revolve around the use of shadows. His prowess with these were witnessed during the Konoha Crush when he effortlessly bound and killed several invading shinobi. In the anime, he also displayed great control over his shadow able to use the Black Spider Lily technique to bind several shinobi, while at the same time freely using a tendril of his shadow to move his comrade to safety.","appearance": "Shikaku had two scars on the right side of his face which were probably his most noticeable feature. Like his son and grandson, he had dark hair tied up into a spiky ponytail, dark eyes as well as a goatee. His ears were also pierced. In Part I, Shikaku wore a meshed shirt underneath his flak jacket, a deer skin coat over that and hand guards."}
{"character_name":"Shikamaru Nara", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/44/Shikamaru_Part_I.png","description": "Shikamaru Nara (奈良シカマル, Nara Shikamaru) is a shinobi of Konohagakure's Nara clan. Though lazy by nature, Shikamaru has a rare intellect that consistently allows him to prevail in combat. The responsibilities that these successes leave him with cause him frequent annoyance, but he gladly accepts them so that he may be of service to his fellow members of Team Asuma, and to prove himself to generations of the past and future. As an adult, he served as chief aide to Naruto when he became the Seventh Hokage, before succeeding him as Eighth Hokage (八代目火影, Hachidaime Hokage, literally meaning: Eighth Fire Shadow) when Naruto disappeared and was believed to have been killed.","affiliation":"Konohagakure","background": "Shikamaru is the only child of Yoshino and Shikaku Nara. When he was young, he once played 'ninja' with other children his age. Chōji Akimichi wanted to play with them, but the other children refused to allow him to do so, claiming he was too stupid and bad to participate. When Shikamaru couldn't convince the others to let Chōji join, he left the game and went to his favourite spot to watch clouds. Chōji happened to be sitting in the same spot when he got there, so Shikamaru introduced himself, and invited Chōji to watch the clouds with him. Chōji asked Shikamaru if he wanted some snacks. From that point onward they were best friends; upon entering Konoha's Ninja Academy, they'd usually sit together in class and hang out afterwards. Shikamaru had very little interest in the class itself, preferring to spend his time sleeping rather than listen to Iruka Umino's lessons. Shikamaru showed the same lack of enthusiasm for the tests he was given and couldn't be bothered to actually answer the questions, leading to his poor grades.","ability": "Due to his poor grades in the Academy, Shikamaru was thought to be anything but a remarkable ninja, but his potential was demonstrated when he was the only member of his graduating class to become a chūnin during Part I. Despite being a newly made chūnin, he could hold his own against jōnin-level opponents like Tayuya of the Sound Four. In Part II, he could defeat Hidan of Akatsuki after leading the latter to a trap. His skills led to him being offered a position as one of the Twelve Guardian Ninja in the anime, being made deputy-commander of the Fourth Division and chief-strategist of the entire Allied Shinobi Forces, as well as the right-hand man of the Seventh Hokage years later. As a member of the Nara clan, Shikamaru is able to manipulate his own shadow. His signature move is the Shadow Imitation Technique, which in the anime he learned before even entering the Academy. By connecting his shadow to a target's, Shikamaru can use the Shadow Imitation Technique to restrain their movements and force them to mimic his own. When used against opponents, they may be able to resist his control, requiring that Shikamaru exert additional effort to keep them bound; when used for whatever reason on allies or others who have been incapacitated, no resistance occurs and the process is accordingly much easier. Throughout Parts I and II, Shikamaru must perform the appropriate hand seals in order to use his shadow, but in later years, he is able to manipulate it without them.","appearance": "hikamaru has narrow brown eyes and a typical expression suggesting he is either bored or irritated. He has shoulder length black hair tied in a spiky ponytail. During Part I, he wears a short-sleeved grey jacket with green-edged sleeves and the rudimentary Nara clan symbol on the back, under which is a green-lined mesh armour T-shirt. He also wears brown pants, a pair of his clan's traditional silver hoop earrings, and wears his blue forehead protector around his left arm. When he becomes a chūnin, he adds a flak jacket over this usual clothing. In Part II, he trades most of his personalised wardrobe for the standard Konoha-nin outfit, the only customisations being green-lined mesh armour on his wrists and ankles and the plate of his forehead protector sewn into his left sleeve. He also replaces the hoop earrings for studs, a gift from Asuma Sarutobi."}
{"character_name":"Shino Aburame", "character_pic":"https://static.wikia.nocookie.net/naruto/images/9/9c/Shino.png","description": "Shino Aburame (油女シノ, Aburame Shino) is a shinobi of Konohagakure's Aburame clan. Quiet, and at times off-putting to some, Shino puts his clan's insect-based techniques to use on Team Kurenai. In later years, Shino became an Academy teacher.","affiliation":"Konohagakure","background": "Shino at one time grew up alongside Torune Aburame as his family took him in under guardianship after Torune's father, Shikuro Aburame, passed away. Despite their different views about friendship, Shino grew close to Torune, viewing him as an older brother. Torune even revealed to Shino his unique breed of microscopic insects. One day, Danzō Shimura approached the two young Aburame with the desire to recruit another young member of a secret technique-using clan for Root. While Danzō had the authority to do so and expressed interest in Shino, not wanting Shino to live a life of loneliness, Torune offered himself, appealing to Danzō by revealing who his father was. Knowing that he would probably never see Torune again but wanting to remain close to his brother-figure in some way, Shino harvested some of Torune's insects and spent years refining his bug breeding technique to produce new beetles that inherited traces of Torune's insects. After enrolling into the Academy and being placed in Iruka Umino's class, he met Kiba Inuzuka, whom he numerously became irritated at due to the pair having polar opposite personalities. During breaks in between classes, he would let his bugs walk on his desk. During a class training session, he watched on alongside Kiba as Shikamaru Nara and Chōji Akimichi refused to fight each other even during training. When Kiba commented that Shikamaru, who had found the process to be too troublesome, would be a genin for the rest of his life, Shino noted that that may not be so as Shikamaru could go on to live a long life and many things could happen, but before he could finish his statement Kiba cut him off.","ability": "Shino showed great potential as a shinobi since early age, having drawn the attention of Danzō, a man with exceedingly high standards, in the anime. As a genin, he easily managed to defeat Zaku Abumi, and later fight Kankurō, a skilled shinobi to a stalemate. During the time-skip, he was promoted to Chūnin alongside his teammates. During the War, he was able to fight and defeat several White Zetsu despite them being Jōnin-calibre in power, and was able to defeat the reincarnated Torune Aburame. A decade later was acknowledged by several individuals as being jōnin-level in skill. As a member of the Aburame clan, Shino was infused at birth with a special breed of insects, called kikaichū, that use his body as a nest and feed on his chakra, living in a form of symbiosis. In return, they attack and do other tasks as he commands forming his main fighting style: in battle, he boxes in opponents with his bugs and then consumes their chakra once they cannot escape. In the anime, Shino is able to transfer this accumulated chakra into a new target. Shino has shown to be able to create insect replicas of himself, which can reform once struck. Offensively, Shino could encase his enemies in a cage of insects, preventing them from moving and depriving them of their chakra; as well as could use a special breed of insects called kidaichū to devour the chakra and even flesh of their victim.","appearance": "Shino is regularly seen sporting the same style as the rest of his clan, consisting of dark round sunglasses and a sea-green jacket with a high, upturned collar. While Shino was in the Academy, he wore a similar outfit to the one he does now in Part II except his jacket then was of a light grey colour. Shino is a fair-skinned man and the tallest member of his graduating class. He has dark, bushy, brown hair and dark, sharp eyes. As with other members of his clan, Shino constantly keeps his eyes covered to others, as even his teammate did not know what his eyes truly looked like."}
{"character_name":"Shizune", "character_pic":"https://static.wikia.nocookie.net/naruto/images/0/0a/Shizune_Infobox.png","description": "Shizune (シズネ) is a jōnin of Konohagakure. An apprentice of Tsunade, Shizune became a talented medical-nin under her tutelage. She accompanies Tsunade during her years-long sabbatical from active shinobi duty, only returning to Konoha once Tsunade becomes its Fifth Hokage. She assists Tsunade in the duties of Hokage, a role she has continued to serve for both the Sixth and Seventh Hokage as well.","affiliation":"Konohagakure","background": "Shizune is the niece of Dan Katō, a renowned shinobi of Konoha. Some time after her uncle's death, Tsunade, his lover, left Konoha and Shizune went with Tsunade as her attendant and apprentice. The bond between Tsunade and Shizune is strong and, above all, the latter sees caring for Tsunade as one of her main priorities. During their time away from the village, Shizune often worried about Tsunade's constant gambling, losing money and then borrowing more. In the anime, on one such occasion when they were at a gambling den, they were approached by the Fourth Raikage and Amai who beseeched Tsunade to help their injured comrade. After Tsunade complied, Shizune was actually the one to conduct the surgery, and when she told the Raikage of her master's two great losses (the deaths of Dan and Nawaki), upon hearing his response that her master was unhinged, she chided the Raikage, throwing the Exploding Insect at his feet. Recomposing herself, she told Amai, who had been aiding in the surgery, to finish up.","ability": "As a jōnin and apprentice of Tsunade, Shizune is undoubtedly a very capable kunoichi. Jiraiya had enough faith in her abilities to leave her to fight Orochimaru's right-hand man, Kabuto Yakushi. A further testament to her credibility is being put in charge of the Logistical Support and Medical Division of the Allied Shinobi Forces during the Fourth Shinobi World War. Shizune is a very talented medical-nin. Her prowess set a high standard for Tsunade's other disciple, Sakura Haruno. Shizune's refined chakra control allowed her to perform even the most complex medical ninjutsu, such as leading a team to regenerate a person's injured body with new cells, while the slightest mistake could be fatal.","appearance": "Shizune is a fair-skinned woman of average height and slender build with onyx eyes and jet-black hair; her hair is straight and shoulder-length with bangs that cover her ears and frame her face. Normally, Shizune is seen in a long bluish-black kimono with white trimmings, held closed by a white obi, and open-toed sandals with low heels. Shizune has also been seen wearing the standard Konoha shinobi outfit complete with flak jacket, when deployed on missions which has distinct, extra-long sleeves. She, however, doesn't wear a forehead protector. Shizune also has the tendency to pin her hair up when working; a trait also shared by Sakura."}
{"character_name":"Tajima Uchiha", "character_pic":"https://static.wikia.nocookie.net/naruto/images/2/26/Tajima_Uchiha.png","description": "Tajima Uchiha (うちはタジマ, Uchiha Tajima) was a member of the famed Uchiha clan during the war-torn era, preceding the era of hidden villages.","affiliation":"","background": "nitially a father of five sons, Tajima lost three of them in battle against the Senju, and was left with Izuna and Madara at the time of his introduction. He made an appearance on the battlefield alongside his son Izuna after finding out that his other son Madara was meeting with Hashirama Senju on a regular basis. Thinking along the same basis as his nemesis Butsuma Senju, he and Izuna attempted to take advantage of Madara's meeting with Hashirama to eliminate another Senju. When he was greeted by Butsuma and Tobirama Senju, the Uchiha noted that they thought along the same lines as he prepared to draw his tantō. Tajima tried to attack Tobirama, intending to use his death to shake Butsuma's resolve, so that he could gain an advantage over him, but his attack was foiled by Hashirama. After Madara admits to being weaker than Hashirama when Tajima asked his son whether or not he was ready to join the fray, the Uchiha reluctantly retreated, and though he was not able to gather any intel on the Senju in this endeavour, Tajima was pleased nonetheless that this situation had allowed Madara to awaken his Sharingan.","ability": "As the wielder of the Sharingan, Tajima was blessed with the various advantageous abilities of the eyes which greatly enhanced his own combat prowess on the battlefield, enough that he was noted to be evenly matched with his rival Butsuma Senju. He also carried a tantō strapped to his lower back, indicating that he was a practitioner of kenjutsu. The fact he was able to survive up until adulthood during an era when many young children died in wars suggested he was a very gifted shinobi.","appearance": "Tajima had dark-coloured eyes, as well as dark-coloured hair that was shaved in the back, all framing a gaunt-looking face which was further accentuated by his mouth which naturally curled downwards. Attire-wise, he wore a standard black attire, with a high collar, a breastplate with additional plating over the outer legs, foot wraps, sandals and a tantō strapped horizontally to his back."}
{"character_name":"Temari Nara", "character_pic":"https://static.wikia.nocookie.net/naruto/images/b/bb/Temari_newshot.png","description": "Temari Nara (奈良テマリ, Nara Temari) is a former kunoichi of Sunagakure's Kazekage Clan and the eldest of the Three Sand Siblings. After marrying Shikamaru Nara, she becomes a member of the Nara Clan and emigrates to Konohagakure, where she works as a kunoichi for the village.","affiliation":"Sunagakure","background": "Temari was born the eldest child of Karura and the Fourth Kazekage: Rasa. While it was customary for close relations to a Kage to be a jinchūriki, neither she nor her younger brother Kankurō were compatible with the One-Tail, so Gaara was chosen. In the anime, growing up as a relative to the Fourth Kazekage and Gaara, Temari had a hard time making friends as everyone was always intimidated by her lineage. One boy, however, Daimaru, would spend much time around her, albeit always to play pranks on her. She also used to play with Sen and Yome when they were little girls.","ability": "Temari wields a giant iron fan (鉄扇, tessen) in battle, which she uses in tandem with her Wind Release nature manipulation to create severe torrents of wind. In addition to being used as a makeshift club or to block attacks, the fan can be used to glide upon for transportation or intimidation, and it seems to be made of some sort of steel, since it is able to deflect kunai and shuriken when opened. Inscribed on her fan are three purple circles spaced equally across its length, which she calls 'stars' (星, hoshi, English TV: moons). As she opens the fan to reveal each star in sequence, the fan's power increases greatly. Once all three moons are revealed, Temari can create slicing whirlwinds that she can guide with her chakra. Her winds allow her to attack from afar and alter the battlefield to her liking, as well as deflect or divert most ranged attacks. A stronger variant of her whirlwinds can be used as a counter against sound wave attacks that can cause genjutsu, making it both a defence and an attack at the same time.","appearance": "emari bears a great resemblance to her mother; she has teal eyes and sandy blonde hair, which is gathered into four consecutive pigtails. In Part I, Temari's outfit consists of a single light purple-coloured, off-the-shoulders garment that extended to halfway down her thighs, with a scarlet sash tied around her waist. In addition to incorporating fishnet worn over her shoulders and legs, specifically on her right calf and her left thigh, she also wore her black forehead protector around her neck."}
{"character_name":"Ten-Tails", "character_pic":"https://static.wikia.nocookie.net/naruto/images/e/e6/Ten-Tails_emerges.png","description": "This Ten-Tails (十尾, Jūbi) is the Tailed Beast incarnation of the God Tree previously cultivated by Isshiki Ōtsutsuki and Kaguya Ōtsutsuki; the latter having eaten its chakra fruit and later merged in a battle against her sons, Hagoromo and Hamura. It is regarded as the progenitor of chakra according to legend, and is tied to the tale of the Sage of Six Paths and the birth of shinobi. To end the beast's rampage, the Sage became the Ten-Tails' jinchūriki and later split its chakra into the nine tailed beasts to prevent it from causing further harm. Centuries later, its revival became the objective of Madara and Obito Uchiha, who both sought to become the beast's jinchūriki in order to further their objectives.","affiliation":"","background": "Long before the founding of the hidden villages, during an era of endless wars between mankind, the God Tree, a tree revered as a deity, bore a chakra fruit once every thousand years. It was later revealed that the Ōtsutsuki planted the Ten-Tails seedling onto the earth with the intent to drain all chakra from the planet so that it could produce a chakra fruit for them to harvest. Although it was forbidden to consume the God Tree's fruit, it was eaten by Princess Kaguya Ōtsutsuki, who used the power it granted her to end the wars plaguing the lands. Some time after this, Kaguya gave birth to two sons who became the first people born with chakra. Later, deciding that her children's chakra was rightfully hers, Kaguya combined with the God Tree to become the Ten-Tails itself, which ravaged the land in an ongoing battle with her children. However, because Kaguya's true motives were not realised, it was instead believed that the God Tree itself had taken on the form of a monster in an attempt to regain the chakra that Kaguya had stolen. In the final confrontation between the Ten-Tails and Kaguya's sons, Hagoromo and Hamura, the two managed to seal the beast into what would become the moon; its chakra was sealed separately within Hagoromo and making him the first jinchūriki. This act, along with many other great deeds throughout his lifetime, resulted in Hagoromo becoming revered as the 'Sage of Six Paths'.","ability": "The Ten-Tails is said to be the progenitor of all that exists in the world. A god that created countries, it has the power to swallow oceans, split the land, and carry mountains. Kurama admitted that it alone wouldn't stand a chance against the Ten-Tails, and stated that the Sage of Six Paths said that its revival would result in the end of the world. The Ten-Tails cannot be sensed through traditional means as it gives off the same sensations as the natural energy circulating throughout the world. It is also capable of manipulating that natural energy. When Naruto attempted to gauge the power of the Ten-Tails using Sage Mode, he was overwhelmed by the vastness of the beast's power, which Kurama claimed was immeasurable. Gyūki stated that the Ten-Tails would be unbeatable if it was allowed to reach its final form.","appearance": "The Ten-Tails is brown in colour and titanic in size; one of its hands is larger than any of the tailed beasts. While the beast possess multiple forms, common attributes include a single eye, which takes up most of its head, and spiky protrusions growing out of its back in a shape reminiscent of a conch shell. n its next form, the Ten-Tails took on the shape of an emaciated humanoid with elongated limbs and a twisting neck. It now possessed visible legs, which it used along with its right arm to stand, as its left arm was missing from the elbow down. The beast's head was altered greatly, as its eye remained on the front of its head, it grew a single ear on the right side, and its mouth — which now contained straight teeth and bore a grin — moved to the left side, with a single triangular nostril appearing above it. Several horns formed on various parts on its head: two above each side of its face, two beneath its eye, and another below its ear."}
{"character_name":"Tsunade", "character_pic":"https://static.wikia.nocookie.net/naruto/images/b/b3/Tsunade_infobox2.png","description": "Tsunade (綱手) is a descendant of the Senju and Uzumaki Clan, and is one of Konohagakure's Sannin. She is famed as the world's strongest kunoichi and its greatest medical-nin. The repeated loss of her loved ones caused Tsunade to later abandon the life of a shinobi for many years. She is eventually persuaded to return to Konoha and take on the mantle of Fifth Hokage, where her skills prove invaluable to the village.","affiliation":"Konohagakure","background": "Tsunade is the granddaughter of Hashirama Senju and Mito Uzumaki. Because Hashirama was the First Hokage of Konohagakure, Tsunade is called 'Princess' (姫, Hime). Hashirama doted on Tsunade when she was very young because she was his first grandchild, and found her deviance and her adoption of his own gambling habits highly amusing. Tsunade's younger brother, Nawaki dreamed of someday becoming Hokage so that he could protect Konoha, their grandfather's legacy. On Nawaki's twelfth birthday, Tsunade kissed his forehead and gave him Hashirama's necklace in the hopes that it would help him achieve his dream. He died the next day, a casualty of the ongoing Second Shinobi World War, thus returning the necklace to her. Tsunade began advocating for the inclusion of medical-nin on all four-man squads in order to avoid future deaths like Nawaki's. Hiruzen, the Third Hokage, agreed with her arguments, but could not dedicate resources to the necessary implementation due to the ongoing war.","ability": "Like other students of the Third Hokage, Tsunade is an exceptionally talented shinobi. Her skills became well-known following the Second Shinobi World War when dubbed by Hanzō as a Sannin, alongside Jiraiya and Orochimaru. Tsunade's skills are popularly held as the reason for Konoha's victory during that war, and in the years following, became known as the world's strongest kunoichi. Despite being rusty, Tsunade's skills easily outclassed Kabuto Yakushi's when they battled, with him having to rely on using a Military Rations Pill to continue battling, and use her fear of blood against her to gain the upperhand. Following the Third Hokage's death, she was unanimously recognised to become the Fifth Hokage, proving her worth by saving countless villagers when Pain decimated. Even the likes of Madara Uchiha admits that Tsunade was worthy of being a Kage. Tsunade has advanced skill with fūinjutsu. With her Strength of a Hundred Seal, she can continuously store up additional chakra into it. When the seal is released, Tsunade has access to all the accumulated chakra, totaling a so-named hundred-times her usual chakra levels. While normally using this extra chakra to perform her techniques, she can also transfer the chakra to others, either to replenish or amplify their own.","appearance": "Tsunade is a fair-skinned woman with brown eyes and straight blonde hair that parts above her forehead. Her hair has shoulder-length bangs that frame her face and the rest reaches her lower back. During her childhood and through her young-adult years she wore her hair in a high ponytail, she later keeps it tied in two loose ponytails. The Strength of a Hundred Seal - taking the appearance of a violet diamond- is clearly visible on her forehead. In her childhood, she wore grey mesh shirt and over it a teal-colored kimono with short sleeves and red-lining around the collars which she secured with a blue sash. She also wore red wristbands and white wrapping over her calves with blue sandals. Tsunade maintains her youthful appearance using a unique Transformation Technique. Tsunade often wears a grass-green haori with the kanji for 'gamble' (賭, kake) on the back, inside a red circle. Underneath she wears a grey, kimono-style blouse with no sleeves, held closed by a broad, dark bluish-grey obi that matches her pants."}
{"character_name":"Udon Ise", "character_pic":"https://static.wikia.nocookie.net/naruto/images/3/30/Udon_Part_II.png","description": "Udon Ise (伊勢ウドン, Ise Udon) is a shinobi of Konohagakure, and the leader of Team 5.","affiliation":"Konohagakure","background": "As a child, Udon was an easy-going and quiet individual. He usually looks very sleepy, and is always seen with a drip of snot hanging from his nose. Udon has stated many times that he loves math, as he is sometimes seen writing math problems during class. As an adult, he is a very collected and straight-forward man who is shown to be keen minded and perceptive. As a teacher, he has a strict but fair teaching style and is not above punishing his students for making mistakes that could have cost them dearly. Overall, his students view him as cool, and were surprised to hear how awkward he was as a child.","ability": "During his time at the Academy, Udon considered himself a loser, due to struggling to properly perform the Clone Technique, leading to him failing to graduate several times. Upon becoming a genin, he could collaboratively perform the Bouncy Bouncy Technique with his teammates, but his repeated mess up on missions cause him to label himself as a burden on his team. Fifteen years after the Fourth Shinobi World War, he had become a jōnin who specialised in producing powerful water tendrils from his mucus. He's also very attentive, able to deduce whether others are under the influence of genjutsu and quickly release them.","appearance": "Udon has short brown hair and dark eyes. He is characterised by the drip of snot always seen hanging from his nose and his circular glasses. While in the Academy, he wore a simple blue shirt which zipped up the middle, a pair of brown pants, sandals and a pair of goggles to represent his membership in the Konohamaru Ninja Squad. As a genin, he has grown noticeably taller, and wears a black top and blue pants with regular shinobi sandals. Instead of goggles, he now wears the village's forehead protector."}
{"character_name":"Unkai Kurama", "character_pic":"https://static.wikia.nocookie.net/naruto/images/0/02/Unkai_Kurama.png","description": "Unkai Kurama (鞍馬雲海, Kurama Unkai) is a shinobi from Konohagakure and a member of the Kurama clan's branch family.","affiliation":"Konohagakure","background": "Overall, he cared about his clan above all other things, even his niece Yakumo's life. After the death of her parents, he petitioned with fellow clan members to have Yakumo killed. The Third Hokage denied their requests, and it seems they have given up on them.","ability": "As a Kurama clan member, he is a very strong genjutsu user, even capable of escaping Kurenai's genjutsu, though having to forfeit his battle with her and retreat. Despite this, he still earned Kurenai's praise. nkai proved to have an accomplished leader amongst his fellow clansmen, with them following his directions even if these were against their comrades. Unkai also proved to have a strong sense of smell, using it to pinpoint Kurenai while she was camouflaged.","appearance": "Unkai has light brown hair that falls over his ears. He also has small black eyes."}
{"character_name":"Uroko Kurama", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/44/Uroko_Kurama.png","description": "Uroko Kurama (鞍馬ウロコ, Kurama Uroko) was a member of the main branch of the Kurama clan. She was also the wife of Murakumo Kurama and the mother of Yakumo Kurama.","affiliation":"Konohagakure","background": "Uroko's daughter and only child, Yakumo, was born with the full scope of the Kurama Clan's Kekkei Genkai, but also with a weak and frail body. As the Kurama clan had produced few ninja where once they were one of the more prominent clans in Konohagakure, Uroko's husband Murakumo was eager to remedy this predicament sought to change the clan's fortunes around by ensuring their daughter's development into her full potential as a genjutsu-user. Her husband approached the Third Hokage and petitioned for a special tutor to oversee her training, hoping that she could overcome her frail condition by focusing sorely on her genjutsu. Later, a fire engulfed the Kurama clan's household and killed both Uroko and her husband, Murakumo. The cause of the fire was Yakumo's own powers; because of the powers she could not control Ido, an independent, sentient and malicious personality that existed within her subconscious could use her powers against her will and started the fire. Uroko's daughter Yakumo, however, unaware of the Ido existence was initially convinced that her parents were killed on the orders of the Third Hokage, Hiruzen Sarutobi, before learning that the deaths of her parents was due to the Ido.","ability": "She was presumably a very skilled kunoichi, being able to obtain the ninja rank of a jōnin.","appearance": "Uroko had very delicate features and long smooth silver hair along with light-coloured eyes. She wore a long sleeved grey jacket with a large red belt wrapped around the waist area. She wore a grey long dress that went down to her feet and she had three different coloured shirts all underneath the grey one. She also wore a necklace."}
{"character_name":"Utakata", "character_pic":"https://static.wikia.nocookie.net/naruto/images/2/27/Utakata.png","description": "Utakata (ウタカタ) was a missing-nin from Kirigakure and the jinchūriki of the Six-Tails.","affiliation":"Kirigakure","background": "At some point, Utakata became the jinchūriki of the Six-Tails, Saiken. At first a loyal shinobi of Kirigakure, he left the village during the 'Bloody Mist' era, and in the manga at some unspecified time either before Gaara's capture by Deidara, or some time in between Gaara's capture and the capture of Yugito Nii by Kakuzu and Hidan, Utakata was captured by the Akatsuki, as after Yugito was sealed, according to Pain only three tailed beasts remained uncaptured, nd he thus died at the age of 26 from having the Six-Tails extracted from his body. At some point, Kabuto Yakushi acquired some of his DNA and reincarnated him.","ability": "In the anime, he was shown to be agile and nimble in battle, effortlessly dodging and outmanoeuvring all of Naruto's melee attacks and collaborative assaults from Nangō, Akaboshi, Benten, and Chūshin. He is a skilled sensor-type, able to notice Naruto's unusual chakra, and that Akaboshi and his group had a change in their chakra flow. He is also knowledgeable in tracking and herbal remedies. Furthermore, he was able to track the natural energy that was gathering from Shiranami's Tsuchigumo Style: Forbidden Life Technique Release: Creation of Heaven and Earth with his Soap Bubble Ninjutsu. After his reincarnation and serving as one of Tobi's Six Paths of Pain, Utakata is seen with both the Sharingan and Rinnegan. Combining the perceptual and predictive abilities of the former with the latter's shared vision ability allowed Utakata to use his attacks in a more precise, coordinated fashion as well as react to enemy attacks more efficiently, both individually and in conjunction and with his fellow jinchūriki.","appearance": "Utakata was a tall, thin young man with pale golden eyes and brown hair that reaches to his shoulders. In the manga, his eyes were very narrow, whereas in the anime his eyes were more of a typical size. His side parting let a large portion of his bangs cover the left side of his face. He wore a long, light blue kimono adorned with a small emblem of three bubbles on the back, and a pair of grey pants underneath, with an orange sash. The kimono hung loose, exposing his chest. In it, he carried a bamboo jug filled with a soap solution, and a pipe."}
{"character_name":"White Snake Sage", "character_pic":"https://static.wikia.nocookie.net/naruto/images/d/d4/Snake_Sage.png","description": "The White Snake Sage (白蛇仙人, Hakuja Sennin) is the leader of the snakes of Ryūchi Cave.","affiliation":"Ryūchi Cave","background": "At some point, Orochimaru discovered the location of Ryūchi Cave through his study of Jūgo's unique powers, and began studying there to master Senjutsu under the White Snake Sage. Unable to attain Sage Mode, he instead developed an alternate method of harnessing his senjutsu chakra through cursed seals. Sometime after injecting himself with Orochimaru's remains, Kabuto Yakushi discovered Ryūchi Cave and received the White Snake Sage's teachings. Under her guidance, Kabuto was able to learn senjutsu and ultimately mastered the use of Sage Mode.","ability": "As a sage, the White Snake Sage is highly knowledgeable in senjutsu and capable of passing on her teachings to others. She is able to inject others with natural energy using her fangs, which she does to those who seek out her training. According to legend, if the trainee's body is unable to withstand this power and transforms into a snake, she will swallow them whole without reservation. In the anime, much like her subjects who are responsible for the cave's trials, she can use genjutsu to make others experience visions, which she can use to relay the thoughts of other snakes to third parties, as well as disguise her true form, to the point of often taking the form of an elderly lady.","appearance": "The Sage is an extremely large, albino Japanese rat snake many times the size of a human, who sits upon a sacred seat with her massive body wrapped in thick coils. Along these coils are yellow circular bands. She wears a turban with two pointed edges and a red orb on top along with an orange headdress. She also wears a chain with a green orb around her neck, similar to the one worn by the Great Toad Sage. Because she has lived in the cave for so long, her body has grown together with the ground. The Sage also smokes, using a long cigarette holder when doing so."}
{"character_name":"White Zetsu", "character_pic":"https://static.wikia.nocookie.net/naruto/images/5/5f/White_Zetsu.png","description": "White Zetsu (白ゼツ, Shiro Zetsu) was half of the Akatsuki member Zetsu (ゼツ, Zetsu), the other being Black Zetsu. He was one of the first victims of Kaguya Ōtsutsuki's Infinite Tsukuyomi, and was eventually pulled from the Demonic Statue of the Outer Path by Black Zetsu, and infused with the DNA of Hashirama Senju by Madara Uchiha.","affiliation":"Akatsuki","background": "White Zetsu was originally one of the victims of Kaguya Ōtsutsuki's Infinite Tsukuyomi, who was transformed after being tethered to the God Tree over the course of years and ultimately stored within the Demonic Statue of the Outer Path. After Madara Uchiha summoned the statue and cultivated Hashirama Senju's DNA into a large flowering tree, Black Zetsu removed White Zetsu and the other victims from inside the husk, leading Madara to believe they were artificial humans created by the statue's chakra and Hashirama's DNA. White Zetsu and other mutated humans were then tasked with intelligence gathering before he and a spiral-patterned Zetsu were entrusted with looking after the rehabilitating Obito Uchiha. Over time, the duo became friends with the young Uchiha.","ability": "White Zetsu was described by Obito as not being a 'front line fighter' and thus never directly participated in battles. However, by using several supporting abilities, he proved to be of great use for his allies and master. He was able to create and remotely communicate with near-identical clones of himself, which could absorb a person's chakra. With his Spore Technique, White Zetsu was able to plant these clones on the bodies of others in the form of spores, which were undetectable even to sensor type and Kage-level shinobi. Once activated, these spores would grow into a white mass which surrounded the individuals they formed on and absorb their chakra while restricting their movements. White Zetsu was capable of utilising all five basic nature transformations along with Yin and Yang Release because he was tethered to the flowering tree grown from Hashirama Senju's DNA, White Zetsu's genetic material and chakra was identical to that of the latter's. Like Hashirama, he was able to use Wood Release, albeit on a much weaker scale. ","appearance": "When together, the two Zetsu were easily distinguished by the two Venus flytrap-like extensions that emerged from their sides, enveloping their head and upper body as a shell, which they were able to open and close. Beneath these extensions, White Zetsu had short green hair and a single yellow eye. The right half of his body was covered by Black Zetsu, whose leg was originally White Zetsu's own right leg. Under their Akatsuki cloak, they wore blue pants and sandals, and had both legs wrapped in bandages. Zetsu's green Akatsuki ring, which bore the kanji for 'sign of the boar' (亥, gai), was worn on Black Zetsu's little finger. In the anime, Zetsu's fingernails were painted pink and his toenails, as seen in his début, were blue."}
{"character_name":"Yagura Karatachi", "character_pic":"https://static.wikia.nocookie.net/naruto/images/e/e0/Yagura.png","description": "Yagura Karatachi (枸橘やぐら, Karatachi Yagura) was the jinchūriki of the Three-Tails, Isobu and the Fourth Mizukage (四代目水影, Yondaime Mizukage, literally meaning: Fourth Water Shadow) of Kirigakure. Yagura is chiefly remembered for a bloody, despotic reign that contributed to Kirigakure being well known as the 'Bloody Mist'.","affiliation":"Kirigakure","background": "As a child, Yagura took part in the village's barbaric ritual where Academy students would be forced to kill each other in order to graduate.  Following the Three-Tails' revival after being 'killed' in Rin Nohara, the tailed beast was sealed within a young Yagura and he learned to control its powers over the following years. As a jinchūriki, he became known as the third person to achieve full control over a tailed beast. Yagura, being the strongest shinobi in his village at that time, was elected as the Fourth Mizukage. In the anime, he effectively united the various islands of the Land of Water under his leadership.","ability": "agura was once the most powerful shinobi in his village, which led to his election as the Fourth Mizukage. He also mastered Isobu's power at a young age, becoming a perfect jinchūriki. In the anime, he was able to simultaneously fight Itachi and Jūzō, two members of Akatsuki, killing the latter and nearly killing the former. Yagura was always seen carrying a club with uneven sized hooks and a green flower on the larger end, implying skills in bōjutsu. In the anime, he was shown able to fend off Jūzō Biwa's assault with Kubikiribōchō using his club. After his reincarnation, serving as one of Tobi's Six Paths of Pain, Yagura was seen with both the Sharingan and Rinnegan. Combined with the perceptual and predictive abilities of the Sharingan, and the shared field of vision ability of the Rinnegan, Yagura is able to battle more effectively and precisely. Just like the rest of the Kage, Yagura was capable of using the Summoning Technique, although what he was capable of calling upon is unknown. As the Three-Tails' jinchūriki, Yagura was granted a significant amount of chakra and stamina from the beast. He was also one of the few people regarded to have achieved full control over their respective beast. He displayed a partial transformation into the Three-Tails, being able to manifest one of its tails.","appearance": "Yagura was a young-looking adult, though rather short for his age. He had short, messy, grey hair, which fell over the right side of his face and spiked up on the left. He also had pupilless pink eyes and what seemed to be a stitch-like scar running from under his left eye, all the way down his cheek. His attire included a grey, sleeveless shirt with the Kiri forehead protector attached to the front, as well as a short-sleeved mesh armour, which he wore a green poncho. He also wore a turquoise sash around his waist, paired with a matching green apron over his pants and a pair of brown boots. Along with it, he would carry a club with uneven sized hooks, which bared a green flower on the larger end."}
{"character_name":"Yahiko", "character_pic":"https://static.wikia.nocookie.net/naruto/images/7/76/Yahiko.png","description": "Yahiko (弥彦) was a shinobi from Amegakure. Alongside his fellow war orphans, Nagato and Konan, he founded and led the Akatsuki in an attempt to bring peace. Following Yahiko's death, Nagato would turn his body into the Deva Path of his Six Paths of Pain, which he used as the continued public image of Akatsuki's leadership.","affiliation":"Amegakure and Akatsuki","background": "Yahiko was orphaned during the Second Shinobi World War, forcing him to steal food in order to survive prior to teaming up with a fellow war orphan named Konan. Soon after they found a place to call home, Yahiko expressed his displeasure from Konan bringing another war orphan, Nagato, into the group. However, Yahiko eventually accepted Nagato and his dog Chibi into his group. Angered by how unfair the world was to them, Yahiko declared that he would become a god to end the fighting. Soon, after the death of Chibi, Yahiko and the others eventually encountered Jiraiya, who looked after them and taught them basic ninjutsu. At one point, Nagato saved Yahiko after an Iwagakure chūnin attacked them. Afterwards, Yahiko vowed to become strong enough to protect Konan, Nagato, and eventually all of Amegakure.","ability": "Yahiko could use Water Release to shoot a jet stream of water from his mouth, and in the anime, create pillars of water to protect him. Yahiko also had the elements of Fire and Wind Release at his disposal. The fact that he was seen carrying a large sword in the flashbacks implied that he was skilled in kenjutsu. He also had good leadership skills, as he was respected by all Akatsuki members of his time, and although he viewed Nagato as the bridge of peace, everyone else viewed him to be the person who would lead them to true peace.","appearance": "Yahiko had short spiky orange hair and blue eyes (depicted as brown in the anime). Under Jiraiya's tutelage, he wore a short black shirt robe with green trimmings, dark pants, a black and white belt that he tied in front with mesh armour underneath. As an original member of Akatsuki, he wore a long black robe with a red line running down the centre along with armour that covered only his mid-section with a pouch attached to it. He also carried a relatively large sword during this time. It was also shown that Yahiko had inherited his master's perverted smile something that ironically enough, embarrassed Jiraiya."}
{"character_name":"Yakumo Kurama", "character_pic":"https://static.wikia.nocookie.net/naruto/images/3/37/Yakumo_Kurama.png","description": "Yakumo Kurama (鞍馬八雲, Kurama Yakumo) is one of the last surviving members of the main branch of the Kurama clan, as well as the heiress to the clan.","affiliation":"Konohagakure","background": "Born with a weak body, she was unable to perform the physical activities required of a ninja. Worried about this development, her father petitioned the Third Hokage to grant Yakumo a special tutor to allow her to become a proper ninja. This tutor was Kurenai Yūhi, who was a genjutsu user like Yakumo. Inspired by the example of Rock Lee, who was unable to use ninjutsu or genjutsu, and his relationship with his sensei Might Guy, Yakumo believed she could become a ninja through simply concentrating upon her genjutsu skills. ","ability": "She inherited the clan's kekkei genkai in its entirety. Her genjutsu is so powerful that only a person with equivalent genjutsu prowess has any chance of escaping. Furthermore, the genjutsu is powerful enough to literally convince the victim's brain to physically reflect anything that happens to the victim within the genjutsu, to their body, making it possible for her to kill her opponents with genjutsu. She often uses paintings as a conduit to cast these illusions, causing those around her to believe what is on the painting as reality, despite it only being an illusion. Despite the frailty of her body, Yakumo's talent in genjutsu is completely overwhelming and has a wide area of effect, as she was able to put the entire Konohagakure under a powerful illusion. In spite of the enormous threat her genjutsu poses to her opponents, it cannot however, affect certain organisms, such as the kikaichū.","appearance": "Yakumo possesses long brown hair and light brown eyes. Her hair is straight on one side, but on the other side it is in a braid. In addition, she sports a clip with two circular designs. For her outfit she wore a pink robe held closed by a pink sash with two pockets on the front. She also wore violet baggy pants and red mesh armour underneath her kimono and legs along with sandals that were orange in colour. Her outfit being sealed while training with Kurenai was a series of kimono-like shirts that had long right sleeves and short left sleeves that were held close by a wide pink sash with red mesh armour underneath it all with a light-blue skirt and a brown headband."}
{"character_name":"Yamato", "character_pic":"https://static.wikia.nocookie.net/naruto/images/f/f7/Yamato_newshot.png","description": "Yamato (ヤマト), also known as 'Tenzō' (テンゾウ, Tenzō), are both code names for this Anbu-turned-jōnin of Konohagakure. As his Wood Release would allow him to be able to keep the Nine-Tails sealed within Naruto Uzumaki in check, he was re-assigned from Anbu to the regular forces, joining Team Kakashi as a temporary replacement for their jōnin-sensei, Kakashi Hatake. While Kakashi eventually returns to the team, Yamato stays on to provide assistance as needed.","affiliation":"Konohagakure","background": "amato graduated from the Academy at the age of six, and at that same age, was promoted to the rank of chūnin. s an infant (child in the anime), he was abducted by Orochimaru and became one of sixty children that were his test subjects. They were injected with the First Hokage's DNA in the hopes that they could replicate the First's ability to use Wood Release. Before Orochimaru could finalise the results of the experiments, he was caught by Hiruzen for his other experiments and had to flee the village. Because every child who had been subjected to the experiment had died after a certain amount of time, Orochimaru believed all remaining test subjects would perish as well. In actuality, this boy was the lone survivor and found himself endowed with an unquantified Wood Release and likewise the First's abilities to control tailed beasts. ","ability": "In the anime, his talents were shown to be enough to join the Anbu while still a child. Due to his abilities and potential, Danzō took him on as his personal apprentice and trained Yamato himself. As a member of the Anbu, Yamato was a highly capable ninja, having one of — if not the finest service record of anyone working under the Third Hokage — leading the Fifth Hokage to have the utmost confidence in him. Upon leaving the organisation, he was promoted to jōnin, with his skills being both utilised to monitor Orochimaru, as well as being recognised to the point a X Card was made of him. Sharing the same DNA as Hashirama Senju, Yamato possesses the First's signature Wood Release kekkei genkai. This kekkei genkai allows him to combine earth-natured chakra in one hand, and water in the other, to create vegetation such as trees and even grass which can be grown from any surface. Using the First Hokage's Necklace to amplify his powers, Yamato can suppress the power of a tailed beast. This legendary ability was one of the reasons that Hashirama Senju was made Hokage in the first place, and it was greatly coveted by Orochimaru.","appearance": "Yamato has short brown hair and black, almond-shaped eyes. While still a child and test subject of Orochimaru, he had long, unkempt hair going past his shoulders. When he débuted, Yamato wore the standard attire of the Anbu: a black, sleeveless jumper under a grey flack jacket with strapped-up shinobi sandals, arm-length gloves with guards over them. He carried a sword strapped to his back, and wore a mask that resembles a cat's face covered in green, and red intricate markings, and the Anbu tattoo on his left shoulder. When he meets up with Naruto, Sakura, and Sai for the first time, however, he has changed into a variation of the standard attire of a Konoha-nin, with a flak jacket."}
{"character_name":"Yashamaru", "character_pic":"https://static.wikia.nocookie.net/naruto/images/e/ef/YashamaruHD.PNG","description": "Yashamaru (夜叉丸) was an Anbu from Sunagakure. He was also the right-hand-man of the Fourth Kazekage.","affiliation":"Sunagakure","background": "ashamaru's elder sister, Karura, died shortly after giving birth to her youngest son Gaara, within whom the One-Tailed Shukaku had been sealed. After her death, Yashamaru was appointed as Gaara's caretaker by the Fourth Kazekage. Unlike his fellow villagers, he attempted to understand his nephew's plight as a jinchūriki, and believed that the sand that flew to Gaara's aid in moments of danger was actually the will of Karura protecting her child. However, when Gaara's inability to control Shukaku proved a problem, the Fourth Kazekage tasked Yashamaru with the duty of attacking the boy both physically and psychologically to test his actual mastery over the beast's power. Yashamaru reluctantly accepted his role in order to teach Gaara about physical pain, emotional pain and love.","ability": "Yashamaru was a very capable shinobi, being an Anbu and the right-hand man of the Fourth Kazekage. He was also a medical-nin, and using his fine chakra control, he could manipulate kunai to guide and launch them at a target.","appearance": "Yashamaru bore a striking, if not identical, resemblance to his sister with his sandy-blond hair, fair skin, and violet eyes, which made him look somewhat feminine. He was usually seen in a simple, dark blue, kimono-style shirt with white trim that was held closed by a white sash along with grey pants. He also wore a pair of black shinobi sandals and a beige apron with the Sunagakure village symbol at the top—the latter of which he wore optionally. He also wore bandages around his head. As an Anbu, he donned the traditional uniform of the Sunagakure-nin which included a turban, the village's forehead protector, flak jacket as well as a cloth that hid the lower half of his face, leaving only his eyes visible."}
{"character_name":"Yoroi Akadō", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/40/Yoroi_Akad%C5%8D.png","description": "Yoroi Akadō (赤胴ヨロイ, Akadō Yoroi) is a Konohagakure shinobi and a teammate of Kabuto Yakushi and Misumi Tsurugi, who later defected and joined Orochimaru and Otogakure.","affiliation":"Konohagakure and Otogakure","background": "Yoroi was previously a shinobi of Konohagakure. For unknown reasons, he defected to Otogakure with his teammate, Misumi Tsurugi. He and his team were able to keep their defection a secret, and at some point, Orochimaru had them participate in the Chūnin Exams to spy on the other participants.","ability": "Yoroi's most notable ability was his capacity to absorb the physical and spiritual energy of an opponent by simply coming into physical contact with them. Yoroi was quite proficient with this technique, as he was able to drain Sasuke's chakra even by just slightly grazing his hair. This extra chakra could also be utilised by himself to perform chakra-taxing techniques.","appearance": "Yoroi's appearance was greatly concealed by the mask he wore around his mouth that hung to around his neck, sunglasses that obscured his eyes and forehead protector which he wore like a bandanna. He also wore what appears to be the standard attire of his team consisting of a high-collared, sleeveless, purple shirt with a short-sleeved, white one underneath, a simple obi around his waist, purple pants, blue sandals and purple fingerless gloves."}
{"character_name":"Yūkimaru", "character_pic":"https://static.wikia.nocookie.net/naruto/images/2/2a/Yukimaru2.png","description": "Yūkimaru (幽鬼丸) is a young orphan who became one of Orochimaru's test subjects, due to his ability to partially control the Three-Tails.","affiliation":"Otogakure","background": "Yūkimaru lived with his mother in a village that was attacked by Orochimaru's followers when Yūkimaru was a child. Guren was one of the ninja raiding the village for Orochimaru, killing everyone she came across. When she collapsed, it was Yūkimaru's mother who tended her. When Guren woke up, she said she would spare her as an act of gratefulness towards the kind woman. However, Guren still had to follow Orochimaru's orders, and when they met again, Guren had to kill her to keep Orochimaru's approval. When Yūkimaru's mother fell, her blood spilt onto the camellias nearby. Their pure white colour was changed to red as the blood was absorbed by the camellia.","ability": "For an unknown reason, Yūkimaru has the ability to partially control the Three-Tails. By use of pills given to him by Kabuto, he can summon the Three-Tails. At first he could only make an apparition of the beast appear, after taking some of Kabuto's pills. Later, after taking a larger dosage of the pills, combined with Guren's Crystal Release, he is able to make the beast fully appear, but couldn't control it. Yūkimaru can also control the Three-Tails for a short while without the aid of Kabuto's pills, as when he restrained it when Guren was in danger of being harmed. When Guren seemingly sacrificed her life to save him, Yūkimaru lost control of himself and used his powers to the fullest which enhanced the Three-Tails strength and rampage enabling it to break through the Four-Corner Sealing Barrier. His abilities seem to be tied to his emotions. Besides being able to control the Three-Tails, Yūkimaru can create a thick mist that completely envelopes the surrounding area, thus allowing him to slip away without the risk of being followed. It also enables the user and his comrades to attack unseen.","appearance": "Yūkimaru has magenta eyes and long pale-green hair. His outfit consisted of a kimono with a jade-green inside and a grey outside along with cadet-blue pants with bandages down to his ankles. In contrast to regular shinobi sandals, his were low cut and dark brown. When he was travelling with Kabuto and later Guren to the lake where the Three-Tails was, he wears a blue cloak."}
{"character_name":"Zaku Abumi", "character_pic":"https://static.wikia.nocookie.net/naruto/images/4/40/Zaku_Abumi.PNG","description": "Zaku Abumi (ザク・アブミ) was a shinobi from Otogakure and a member of Team Dosu, which took part in the Chūnin Exams under covert orders from Orochimaru.","affiliation":"Otogakure","background": "In the anime, growing up as an orphan that lived on the streets and stole for a living, he was beaten for it. When Orochimaru found him, he told Zaku that he saw potential in him and offered to help him develop it in exchange for his loyalty, which Zaku accepted. Sometime later Zaku was seen singlehandedly fighting and defeating several Takigakure shinobi. From that day forward he refused to give up, even at the cost of his own life, not knowing that Orochimaru only took him in as a disposable pawn, a fact that his teammate started to suspect at the Chūnin Exams.","ability": "Zaku, like many ninja from Otogakure, had been physically altered with unnatural enhancements that improved his abilities; in his case, he was fitted with hollow air tubes that extended through his arms and opened through his hands, allowing him to propel a combination of air pressure and sound in various ratios, controlled by his chakra. In his fight against Shino, Zaku claimed to be able to control the sound more precisely than simply firing it in one direction, but this was never shown. A proven downside of Zaku's ability was, that should the air tubes be clogged, it would result in a terrible backfire, as the air cannot escape out, instead they would burst out of the side of his arms, causing great backlash damage, to the point of having his arms being destroyed inside out.","appearance": "Zaku had spiky, black hair and dark eyes. He wore a beige shirt with two black stripes and three prints of the kanji for death (死, shi) down the front. His forehead protector had an attached happuri under the cloth rather than connected to the metal plate, resembling Yamato's. As with his teammates Dosu and Kin, he wore a snake-patterned scarf around his neck."}
